CZ4013/summary.org
#+SETUPFILE: setup.org
#+TITLE: CZ4013 Distributed Systems Summary
#+AUTHOR: Eric Leonardo Lim
* Tasks
** TODO Chandy & Lamport Algorithm at Global States
** TODO Data-Centric Consistency Models & Protocols
** TODO Complete document (2 sections left)
* Introduction
** What is DS?
*** Definition
A set of networked computers that _communicate_ and _coordinate_ their actions only by _passing messages_.
** Fundamental Characteristics of DS
*** Concurrency
- More computer \rightarrow Higher capacity \rightarrow Higher performance
- Need coordination
*** Loosely coupled
- No global clock
  - difficult sync
  - lack certainty
  - difficult algo design
- No global shared memory
  - interaction by message passing
*** Independent failures
- difficult detection
- more fault-tolerant if properly designed
** Main Motivation of DS: Resource Sharing
*** Description
We can share resources (e.g. information, hardware, software) over a DS to save cost and manpower.

Resources are shared via _services_. Server accepts client requests, performs services, responds to clients. Requests and replies are sent in form of messages.
