CZ4013/summary.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CZ4013 Distributed Systems Summary</title>
<!-- 2018-04-27 Fri 16:02 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Eric Leonardo Lim" />
<link rel="stylesheet" href="worg.css" type="text/css" media="screen" />
</head>
<body>
<div id="content">
<h1 class="title">CZ4013 Distributed Systems Summary</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Tasks</a>
<ul>
<li><a href="#sec-1-1">1.1. <span class="todo TODO">TODO</span> Chandy &amp; Lamport Algorithm at Global States</a></li>
<li><a href="#sec-1-2">1.2. <span class="todo TODO">TODO</span> Data-Centric Consistency Models &amp; Protocols</a></li>
<li><a href="#sec-1-3">1.3. <span class="todo TODO">TODO</span> Complete document (2 sections left)</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Introduction</a>
<ul>
<li><a href="#sec-2-1">2.1. What is DS?</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. Definition</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Fundamental Characteristics of DS</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. Concurrency</a></li>
<li><a href="#sec-2-2-2">2.2.2. Loosely coupled</a></li>
<li><a href="#sec-2-2-3">2.2.3. Independent failures</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. Main Motivation of DS: Resource Sharing</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. Description</a></li>
<li><a href="#sec-2-3-2">2.3.2. Service</a></li>
<li><a href="#sec-2-3-3">2.3.3. Server</a></li>
<li><a href="#sec-2-3-4">2.3.4. Client</a></li>
<li><a href="#sec-2-3-5">2.3.5. Remote Invocation</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4. DS Issues and Problems</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1. Heterogeneity</a></li>
<li><a href="#sec-2-4-2">2.4.2. Scalability</a></li>
<li><a href="#sec-2-4-3">2.4.3. Failure handling</a></li>
</ul>
</li>
<li><a href="#sec-2-5">2.5. Architectural Models</a>
<ul>
<li><a href="#sec-2-5-1">2.5.1. SW and HW layers (vertical)</a></li>
<li><a href="#sec-2-5-2">2.5.2. System architectures (horizontal)</a></li>
</ul>
</li>
<li><a href="#sec-2-6">2.6. Fundamental Models</a>
<ul>
<li><a href="#sec-2-6-1">2.6.1. Interaction Model</a></li>
<li><a href="#sec-2-6-2">2.6.2. Failure Model</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. Interprocess Communication</a>
<ul>
<li><a href="#sec-3-1">3.1. External Data Representation &amp; Mashalling</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. Marshal &amp; Unmarshal</a></li>
<li><a href="#sec-3-1-2">3.1.2. CORBA's Common Data Representation</a></li>
<li><a href="#sec-3-1-3">3.1.3. Java object serialization</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2. Client-Server Communication</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. Reliability</a></li>
<li><a href="#sec-3-2-2">3.2.2. UDP</a></li>
<li><a href="#sec-3-2-3">3.2.3. TCP</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. Distributed Objects &amp; Remote Invocation</a>
<ul>
<li><a href="#sec-4-1">4.1. Object Model</a></li>
<li><a href="#sec-4-2">4.2. Distributed Object Model</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1. Description</a></li>
<li><a href="#sec-4-2-2">4.2.2. Invocation Semantics</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3. Architecture of RMI</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1. Proxy</a></li>
<li><a href="#sec-4-3-2">4.3.2. Communication Modules</a></li>
<li><a href="#sec-4-3-3">4.3.3. Skeleton</a></li>
<li><a href="#sec-4-3-4">4.3.4. Binder</a></li>
<li><a href="#sec-4-3-5">4.3.5. Description</a></li>
</ul>
</li>
<li><a href="#sec-4-4">4.4. Java RMI Example</a>
<ul>
<li><a href="#sec-4-4-1">4.4.1. Polling</a></li>
<li><a href="#sec-4-4-2">4.4.2. Callback</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-5">5. Distributed File Systems</a>
<ul>
<li><a href="#sec-5-1">5.1. Introduction</a>
<ul>
<li><a href="#sec-5-1-1">5.1.1. File System</a></li>
<li><a href="#sec-5-1-2">5.1.2. Distributed File System</a></li>
</ul>
</li>
<li><a href="#sec-5-2">5.2. Sun NFS</a>
<ul>
<li><a href="#sec-5-2-1">5.2.1. Overview</a></li>
<li><a href="#sec-5-2-2">5.2.2. Architecture</a></li>
<li><a href="#sec-5-2-3">5.2.3. Client-Server Communication</a></li>
<li><a href="#sec-5-2-4">5.2.4. Client Caching</a></li>
</ul>
</li>
<li><a href="#sec-5-3">5.3. AFS and Code File Systems</a>
<ul>
<li><a href="#sec-5-3-1">5.3.1. Overview</a></li>
<li><a href="#sec-5-3-2">5.3.2. AFS Architecture</a></li>
<li><a href="#sec-5-3-3">5.3.3. Whole-File Serving and Caching</a></li>
<li><a href="#sec-5-3-4">5.3.4. Coda File System</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-6">6. P2P File Sharing Systems</a>
<ul>
<li><a href="#sec-6-1">6.1. Introduction</a></li>
<li><a href="#sec-6-2">6.2. Examples</a>
<ul>
<li><a href="#sec-6-2-1">6.2.1. File sharing</a></li>
<li><a href="#sec-6-2-2">6.2.2. Communication</a></li>
<li><a href="#sec-6-2-3">6.2.3. DHT</a></li>
</ul>
</li>
<li><a href="#sec-6-3">6.3. Unstructured P2P File Sharing</a>
<ul>
<li><a href="#sec-6-3-1">6.3.1. Overview</a></li>
<li><a href="#sec-6-3-2">6.3.2. Napster</a></li>
<li><a href="#sec-6-3-3">6.3.3. Gnutella</a></li>
<li><a href="#sec-6-3-4">6.3.4. KaZaA</a></li>
</ul>
</li>
<li><a href="#sec-6-4">6.4. Structured DHT Systems</a>
<ul>
<li><a href="#sec-6-4-1">6.4.1. Overview</a></li>
<li><a href="#sec-6-4-2">6.4.2. DHT Services</a></li>
<li><a href="#sec-6-4-3">6.4.3. Consistent Hashing</a></li>
<li><a href="#sec-6-4-4">6.4.4. Chord</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-7">7. Name Services</a>
<ul>
<li><a href="#sec-7-1">7.1. Names and Name Services</a>
<ul>
<li><a href="#sec-7-1-1">7.1.1. Names and Addresses</a></li>
<li><a href="#sec-7-1-2">7.1.2. Name Service</a></li>
<li><a href="#sec-7-1-3">7.1.3. Main Requirements</a></li>
<li><a href="#sec-7-1-4">7.1.4. Namespace</a></li>
<li><a href="#sec-7-1-5">7.1.5. Name Resolution Process</a></li>
<li><a href="#sec-7-1-6">7.1.6. Iterative Client-Controlled Navigation</a></li>
<li><a href="#sec-7-1-7">7.1.7. Nonrecursive Server-Controlled Navigation</a></li>
<li><a href="#sec-7-1-8">7.1.8. Recursive Server-Controlled Navigation</a></li>
</ul>
</li>
<li><a href="#sec-7-2">7.2. Domain Name System</a>
<ul>
<li><a href="#sec-7-2-1">7.2.1. Overview</a></li>
<li><a href="#sec-7-2-2">7.2.2. Hierarchical Name Space</a></li>
<li><a href="#sec-7-2-3">7.2.3. Name Space Partitioning</a></li>
<li><a href="#sec-7-2-4">7.2.4. DNS Name Servers</a></li>
<li><a href="#sec-7-2-5">7.2.5. DNS Queries</a></li>
<li><a href="#sec-7-2-6">7.2.6. Replication for Reliability</a></li>
<li><a href="#sec-7-2-7">7.2.7. DNS Name Resolution Process</a></li>
<li><a href="#sec-7-2-8">7.2.8. Caching</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-8">8. Time and Global States</a>
<ul>
<li><a href="#sec-8-1">8.1. Synchronizing Physical Clocks</a>
<ul>
<li><a href="#sec-8-1-1">8.1.1. Computer Clocks</a></li>
<li><a href="#sec-8-1-2">8.1.2. Cristian's Method</a></li>
<li><a href="#sec-8-1-3">8.1.3. Berkeley Algorithm</a></li>
<li><a href="#sec-8-1-4">8.1.4. NTP</a></li>
</ul>
</li>
<li><a href="#sec-8-2">8.2. Causal Ordering and Logical Clocks</a>
<ul>
<li><a href="#sec-8-2-1">8.2.1. System model</a></li>
<li><a href="#sec-8-2-2">8.2.2. Causal Ordering</a></li>
<li><a href="#sec-8-2-3">8.2.3. Lamport's Logical Clocks</a></li>
<li><a href="#sec-8-2-4">8.2.4. Vector Clocks</a></li>
</ul>
</li>
<li><a href="#sec-8-3">8.3. Global States</a>
<ul>
<li><a href="#sec-8-3-1">8.3.1. Motivation</a></li>
<li><a href="#sec-8-3-2">8.3.2. System Model</a></li>
<li><a href="#sec-8-3-3">8.3.3. Consistent Cut</a></li>
<li><a href="#sec-8-3-4">8.3.4. Recording Snapshot</a></li>
<li><a href="#sec-8-3-5">8.3.5. Chandy &amp; Lamport Algorithm</a></li>
</ul>
</li>
<li><a href="#sec-8-4">8.4. Distributed Debugging</a>
<ul>
<li><a href="#sec-8-4-1">8.4.1. Description</a></li>
<li><a href="#sec-8-4-2">8.4.2. Lattice of Consistent Global States</a></li>
<li><a href="#sec-8-4-3">8.4.3. Observing Consistent Global States</a></li>
<li><a href="#sec-8-4-4">8.4.4. Global State Consistency Theorem</a></li>
<li><a href="#sec-8-4-5">8.4.5. Debugging</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-9">9. Coordination and Agreement</a>
<ul>
<li><a href="#sec-9-1">9.1. Introduction</a></li>
<li><a href="#sec-9-2">9.2. Distributed Mutex</a>
<ul>
<li><a href="#sec-9-2-1">9.2.1. Overview</a></li>
<li><a href="#sec-9-2-2">9.2.2. System Model</a></li>
<li><a href="#sec-9-2-3">9.2.3. Requirements</a></li>
<li><a href="#sec-9-2-4">9.2.4. Performance Metrics</a></li>
<li><a href="#sec-9-2-5">9.2.5. Central Server Algorithm</a></li>
<li><a href="#sec-9-2-6">9.2.6. Ring-Based Algorithms</a></li>
<li><a href="#sec-9-2-7">9.2.7. Ricart and Agrawala Algorithm</a></li>
</ul>
</li>
<li><a href="#sec-9-3">9.3. Election</a>
<ul>
<li><a href="#sec-9-3-1">9.3.1. Introduction</a></li>
<li><a href="#sec-9-3-2">9.3.2. Performance Metrics</a></li>
<li><a href="#sec-9-3-3">9.3.3. Ring-Based Algorithm</a></li>
<li><a href="#sec-9-3-4">9.3.4. Bully Algorithm</a></li>
</ul>
</li>
<li><a href="#sec-9-4">9.4. Consensus Problem</a>
<ul>
<li><a href="#sec-9-4-1">9.4.1. Introduction</a></li>
<li><a href="#sec-9-4-2">9.4.2. System Model</a></li>
<li><a href="#sec-9-4-3">9.4.3. Requirements</a></li>
<li><a href="#sec-9-4-4">9.4.4. Synchronous</a></li>
<li><a href="#sec-9-4-5">9.4.5. Asynchronous = Impossible</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-10">10. Replication and Consistency</a>
<ul>
<li><a href="#sec-10-1">10.1. Introduction</a></li>
<li><a href="#sec-10-2">10.2. System Model</a>
<ul>
<li><a href="#sec-10-2-1">10.2.1. Static vs Dynamic</a></li>
<li><a href="#sec-10-2-2">10.2.2. Transparency</a></li>
<li><a href="#sec-10-2-3">10.2.3. Data operations</a></li>
<li><a href="#sec-10-2-4">10.2.4. Possible failures</a></li>
<li><a href="#sec-10-2-5">10.2.5. Consistency model</a></li>
</ul>
</li>
<li><a href="#sec-10-3">10.3. Data-Centric Consistency Models</a>
<ul>
<li><a href="#sec-10-3-1">10.3.1. Overview</a></li>
<li><a href="#sec-10-3-2">10.3.2. Strict concurrency</a></li>
<li><a href="#sec-10-3-3">10.3.3. Sequential concurrency</a></li>
<li><a href="#sec-10-3-4">10.3.4. Causal and FIFO</a></li>
</ul>
</li>
<li><a href="#sec-10-4">10.4. Data-Centric Consistency Protocols</a>
<ul>
<li><a href="#sec-10-4-1">10.4.1. Description</a></li>
<li><a href="#sec-10-4-2">10.4.2. Primary-Based Protocols</a></li>
<li><a href="#sec-10-4-3">10.4.3. Replicated-Write Protocols</a></li>
</ul>
</li>
<li><a href="#sec-10-5">10.5. Client-Centric Consistency Models</a>
<ul>
<li><a href="#sec-10-5-1">10.5.1. Overview</a></li>
<li><a href="#sec-10-5-2">10.5.2. Monotonic reads</a></li>
<li><a href="#sec-10-5-3">10.5.3. Monotonic writes</a></li>
<li><a href="#sec-10-5-4">10.5.4. Read your writes</a></li>
<li><a href="#sec-10-5-5">10.5.5. Writes follow reads</a></li>
</ul>
</li>
<li><a href="#sec-10-6">10.6. Client-Centric Consistency Protocols</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Tasks</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <span class="todo TODO">TODO</span> Chandy &amp; Lamport Algorithm at Global States</h3>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> <span class="todo TODO">TODO</span> Data-Centric Consistency Models &amp; Protocols</h3>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> <span class="todo TODO">TODO</span> Complete document (2 sections left)</h3>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> What is DS?</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Definition</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
A set of networked computers that <span class="underline">communicate</span> and <span class="underline">coordinate</span> their actions only by <span class="underline">passing messages</span>.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Fundamental Characteristics of DS</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Concurrency</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>More computer &rarr; Higher capacity &rarr; Higher performance
</li>
<li>Need coordination
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Loosely coupled</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li>No global clock
<ul class="org-ul">
<li>difficult sync
</li>
<li>lack certainty
</li>
<li>difficult algo design
</li>
</ul>
</li>
<li>No global shared memory
<ul class="org-ul">
<li>interaction by message passing
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> Independent failures</h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li>difficult detection
</li>
<li>more fault-tolerant if properly designed
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Main Motivation of DS: Resource Sharing</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> Description</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
We can share resources (e.g. information, hardware, software) over a DS to save cost and manpower.
</p>

<p>
Resources are shared via <span class="underline">services</span>. Server accepts client requests, performs services, responds to clients. Requests and replies are sent in form of messages.
</p>
</div>
</div>
