CZ4013/summary.org
*** Service
Distinct part of computer system providing accesses to managed resources
*** Server
Process managing resources
*** Client
Process requesting resources access 
*** Remote Invocation
a complete interaction between client & server. (request to response).
** DS Issues and Problems
*** Heterogeneity
**** Networks
**** Hardware
**** OS
**** Programming languages
*** Scalability
**** Approaches to handle increasing demand
- Caching and data replication
- Deploy multiple servers
**** Avoid bottlenecks
- Prefer decentralized to centralized
**** Prevent SW resources from running out
- e.g. IP length
*** Failure handling
**** Detecting
e.g. checksum for corruption
**** Masking
e.g. retransmission for losts
**** Tolerating
use redundancy
**** Recovery
- rollback when crashing
- not leaving data in inconsistent state
** Architectural Models
*** SW and HW layers (vertical)
**** Platform
Bring system's programming interface up to a level that facilitates communication and coordination between processes.
***** Hardware
***** OS
**** Middleware
SW layer to mask heterogeneity and provide convenient programming model.
Provide generic services to applications, e.g.:
- Naming
- Security
- Persistent storage
e.g. Sun RPC, Java RMI, CORBA
**** Applications/services
*** System architectures (horizontal)
**** Client-server
Simple yet useful. Division of work among servers: partitioning and replication.
***** Server
Processes that manage resources
***** Client
Processes that use/access service
**** P2P
- All processes play similar roles
- No distinction of roles
- More complex
** Fundamental Models
More formal description of common and intrinsic properties
*** Interaction Model
**** Synchronous DS
- Bounds on
  - Processing time
  - Transmission time
  - Clock drift rate
- Infer properties
  - Timeout to detect failures
  - Bound lag
**** Asynchronous DS
- No bounds
- Model internet
- Can't use timeouts to detect failures
*** Failure Model
**** Omission failure
***** Process
Crash
***** Communication
Fail to deliver
**** Byzantine failure
- cause trouble
- arbitrarily omit intended steps
- arbitrarily take unintended steps
- process
  - set wrong values
  - return wrong result
- communication
  - corruption
  - more than once
* Interprocess Communication
** External Data Representation & Mashalling
*** Marshal & Unmarshal
- data transmitted as sequence of bytes
- data structures must be flattened
- different representations of same datatype
  - big endian: MSB first
  - little endian: LSB first
- extrenal data representation
  - agreed standard for representation
- interprocess communication
  - define standard
  - marshalling
    - structured & primitive \rightarrow external data representation
  - unmarshalling
    - external data representation \rightarrow structured & primitive
*** CORBA's Common Data Representation
- can represent all primitive and constructed datatypes
- types of data items are not given
- it is assumed that sender and recipient have common knowledge of order and types of data items
*** Java object serialization
Deserialization does not require prior knowledge of object types.

#+BEGIN_SRC java
class Person implements Serializable{
  private String name;
  private String place;
  private int year;
}
#+END_SRC

Person {"Smith","London",1934} will be serialized as:
- Person
- Version number (8 bytes)
- h0 (class handle)
- 3 (# of fields)
- int year
- java.lang.String name
- java.lang.String place
- 1934
- 5 Smith
- 6 London
- h1 (object handle)

#+BEGIN_SRC java
class Person implements Serializable{
  private Person one;
  private Person two;
  public Couple(Person a, Person b){
    one = a;
    two = b;
  }
}
#+END_SRC

Couple { {"Smith","London",1934} , {"Jones","Paris",1945} } will be serialized as:
- Couple
- 8 byte version number
- h0
- 2
- Person one
- Person two
- Person
- 8 byte version number
- h1
- 3
- int year
- java.lang.String name
- java.lang.String place
- 1934
- 5 Smith
- 6 London
- h2
- 1945
- 5 Jones
- 5 Paris
- h3
- h4

** Client-Server Communication
*** Reliability
