CZ4013/summary.html
<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> Service</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Distinct part of computer system providing accesses to managed resources
</p>
</div>
</div>
<div id="outline-container-sec-2-3-3" class="outline-4">
<h4 id="sec-2-3-3"><span class="section-number-4">2.3.3</span> Server</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
Process managing resources
</p>
</div>
</div>
<div id="outline-container-sec-2-3-4" class="outline-4">
<h4 id="sec-2-3-4"><span class="section-number-4">2.3.4</span> Client</h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
Process requesting resources access 
</p>
</div>
</div>
<div id="outline-container-sec-2-3-5" class="outline-4">
<h4 id="sec-2-3-5"><span class="section-number-4">2.3.5</span> Remote Invocation</h4>
<div class="outline-text-4" id="text-2-3-5">
<p>
a complete interaction between client &amp; server. (request to response).
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> DS Issues and Problems</h3>
<div class="outline-text-3" id="text-2-4">
</div><div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> Heterogeneity</h4>
<div class="outline-text-4" id="text-2-4-1">
</div><ol class="org-ol"><li><a id="sec-2-4-1-1" name="sec-2-4-1-1"></a>Networks<br  /></li>
<li><a id="sec-2-4-1-2" name="sec-2-4-1-2"></a>Hardware<br  /></li>
<li><a id="sec-2-4-1-3" name="sec-2-4-1-3"></a>OS<br  /></li>
<li><a id="sec-2-4-1-4" name="sec-2-4-1-4"></a>Programming languages<br  /></li></ol>
</div>
<div id="outline-container-sec-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> Scalability</h4>
<div class="outline-text-4" id="text-2-4-2">
</div><ol class="org-ol"><li><a id="sec-2-4-2-1" name="sec-2-4-2-1"></a>Approaches to handle increasing demand<br  /><div class="outline-text-5" id="text-2-4-2-1">
<ul class="org-ul">
<li>Caching and data replication
</li>
<li>Deploy multiple servers
</li>
</ul>
</div>
</li>
<li><a id="sec-2-4-2-2" name="sec-2-4-2-2"></a>Avoid bottlenecks<br  /><div class="outline-text-5" id="text-2-4-2-2">
<ul class="org-ul">
<li>Prefer decentralized to centralized
</li>
</ul>
</div>
</li>
<li><a id="sec-2-4-2-3" name="sec-2-4-2-3"></a>Prevent SW resources from running out<br  /><div class="outline-text-5" id="text-2-4-2-3">
<ul class="org-ul">
<li>e.g. IP length
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-2-4-3" class="outline-4">
<h4 id="sec-2-4-3"><span class="section-number-4">2.4.3</span> Failure handling</h4>
<div class="outline-text-4" id="text-2-4-3">
</div><ol class="org-ol"><li><a id="sec-2-4-3-1" name="sec-2-4-3-1"></a>Detecting<br  /><div class="outline-text-5" id="text-2-4-3-1">
<p>
e.g. checksum for corruption
</p>
</div>
</li>
<li><a id="sec-2-4-3-2" name="sec-2-4-3-2"></a>Masking<br  /><div class="outline-text-5" id="text-2-4-3-2">
<p>
e.g. retransmission for losts
</p>
</div>
</li>
<li><a id="sec-2-4-3-3" name="sec-2-4-3-3"></a>Tolerating<br  /><div class="outline-text-5" id="text-2-4-3-3">
<p>
use redundancy
</p>
</div>
</li>
<li><a id="sec-2-4-3-4" name="sec-2-4-3-4"></a>Recovery<br  /><div class="outline-text-5" id="text-2-4-3-4">
<ul class="org-ul">
<li>rollback when crashing
</li>
<li>not leaving data in inconsistent state
</li>
</ul>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Architectural Models</h3>
<div class="outline-text-3" id="text-2-5">
</div><div id="outline-container-sec-2-5-1" class="outline-4">
<h4 id="sec-2-5-1"><span class="section-number-4">2.5.1</span> SW and HW layers (vertical)</h4>
<div class="outline-text-4" id="text-2-5-1">
</div><ol class="org-ol"><li><a id="sec-2-5-1-1" name="sec-2-5-1-1"></a>Platform<br  /><div class="outline-text-5" id="text-2-5-1-1">
<p>
Bring system's programming interface up to a level that facilitates communication and coordination between processes.
</p>
</div>
<ol class="org-ol"><li><a id="sec-2-5-1-1-1" name="sec-2-5-1-1-1"></a>Hardware<br  /></li>
<li><a id="sec-2-5-1-1-2" name="sec-2-5-1-1-2"></a>OS<br  /></li></ol>
</li>
<li><a id="sec-2-5-1-2" name="sec-2-5-1-2"></a>Middleware<br  /><div class="outline-text-5" id="text-2-5-1-2">
<p>
SW layer to mask heterogeneity and provide convenient programming model.
Provide generic services to applications, e.g.:
</p>
<ul class="org-ul">
<li>Naming
</li>
<li>Security
</li>
<li>Persistent storage
</li>
</ul>
<p>
e.g. Sun RPC, Java RMI, CORBA
</p>
</div>
</li>
<li><a id="sec-2-5-1-3" name="sec-2-5-1-3"></a>Applications/services<br  /></li></ol>
</div>
<div id="outline-container-sec-2-5-2" class="outline-4">
<h4 id="sec-2-5-2"><span class="section-number-4">2.5.2</span> System architectures (horizontal)</h4>
<div class="outline-text-4" id="text-2-5-2">
</div><ol class="org-ol"><li><a id="sec-2-5-2-1" name="sec-2-5-2-1"></a>Client-server<br  /><div class="outline-text-5" id="text-2-5-2-1">
<p>
Simple yet useful. Division of work among servers: partitioning and replication.
</p>
</div>
<ol class="org-ol"><li><a id="sec-2-5-2-1-1" name="sec-2-5-2-1-1"></a>Server<br  /><div class="outline-text-6" id="text-2-5-2-1-1">
<p>
Processes that manage resources
</p>
</div>
</li>
<li><a id="sec-2-5-2-1-2" name="sec-2-5-2-1-2"></a>Client<br  /><div class="outline-text-6" id="text-2-5-2-1-2">
<p>
Processes that use/access service
</p>
</div>
</li></ol>
</li>
<li><a id="sec-2-5-2-2" name="sec-2-5-2-2"></a>P2P<br  /><div class="outline-text-5" id="text-2-5-2-2">
<ul class="org-ul">
<li>All processes play similar roles
</li>
<li>No distinction of roles
</li>
<li>More complex
</li>
</ul>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Fundamental Models</h3>
<div class="outline-text-3" id="text-2-6">
<p>
More formal description of common and intrinsic properties
</p>
</div>
<div id="outline-container-sec-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="section-number-4">2.6.1</span> Interaction Model</h4>
<div class="outline-text-4" id="text-2-6-1">
</div><ol class="org-ol"><li><a id="sec-2-6-1-1" name="sec-2-6-1-1"></a>Synchronous DS<br  /><div class="outline-text-5" id="text-2-6-1-1">
<ul class="org-ul">
<li>Bounds on
<ul class="org-ul">
<li>Processing time
</li>
<li>Transmission time
</li>
<li>Clock drift rate
</li>
</ul>
</li>
<li>Infer properties
<ul class="org-ul">
<li>Timeout to detect failures
</li>
<li>Bound lag
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-2-6-1-2" name="sec-2-6-1-2"></a>Asynchronous DS<br  /><div class="outline-text-5" id="text-2-6-1-2">
<ul class="org-ul">
<li>No bounds
</li>
<li>Model internet
</li>
<li>Can't use timeouts to detect failures
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-2-6-2" class="outline-4">
<h4 id="sec-2-6-2"><span class="section-number-4">2.6.2</span> Failure Model</h4>
<div class="outline-text-4" id="text-2-6-2">
</div><ol class="org-ol"><li><a id="sec-2-6-2-1" name="sec-2-6-2-1"></a>Omission failure<br  /><ol class="org-ol"><li><a id="sec-2-6-2-1-1" name="sec-2-6-2-1-1"></a>Process<br  /><div class="outline-text-6" id="text-2-6-2-1-1">
<p>
Crash
</p>
</div>
</li>
<li><a id="sec-2-6-2-1-2" name="sec-2-6-2-1-2"></a>Communication<br  /><div class="outline-text-6" id="text-2-6-2-1-2">
<p>
Fail to deliver
</p>
</div>
</li></ol>
</li>
<li><a id="sec-2-6-2-2" name="sec-2-6-2-2"></a>Byzantine failure<br  /><div class="outline-text-5" id="text-2-6-2-2">
<ul class="org-ul">
<li>cause trouble
</li>
<li>arbitrarily omit intended steps
</li>
<li>arbitrarily take unintended steps
</li>
<li>process
<ul class="org-ul">
<li>set wrong values
</li>
<li>return wrong result
</li>
</ul>
</li>
<li>communication
<ul class="org-ul">
<li>corruption
</li>
<li>more than once
</li>
</ul>
</li>
</ul>
</div>
</li></ol>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Interprocess Communication</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> External Data Representation &amp; Mashalling</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Marshal &amp; Unmarshal</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>data transmitted as sequence of bytes
</li>
<li>data structures must be flattened
</li>
<li>different representations of same datatype
<ul class="org-ul">
<li>big endian: MSB first
</li>
<li>little endian: LSB first
</li>
</ul>
</li>
<li>extrenal data representation
<ul class="org-ul">
<li>agreed standard for representation
</li>
</ul>
</li>
<li>interprocess communication
<ul class="org-ul">
<li>define standard
</li>
<li>marshalling
<ul class="org-ul">
<li>structured &amp; primitive &rarr; external data representation
</li>
</ul>
</li>
<li>unmarshalling
<ul class="org-ul">
<li>external data representation &rarr; structured &amp; primitive
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> CORBA's Common Data Representation</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>can represent all primitive and constructed datatypes
</li>
<li>types of data items are not given
</li>
<li>it is assumed that sender and recipient have common knowledge of order and types of data items
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> Java object serialization</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Deserialization does not require prior knowledge of object types.
</p>

<div class="org-src-container">

<pre class="src src-java">class Person implements Serializable{
  private String name;
  private String place;
  private int year;
}
</pre>
</div>

<p>
Person {"Smith","London",1934} will be serialized as:
</p>
<ul class="org-ul">
<li>Person
</li>
<li>Version number (8 bytes)
</li>
<li>h0 (class handle)
</li>
<li>3 (# of fields)
</li>
<li>int year
</li>
<li>java.lang.String name
</li>
<li>java.lang.String place
</li>
<li>1934
</li>
<li>5 Smith
</li>
<li>6 London
</li>
<li>h1 (object handle)
</li>
</ul>

<div class="org-src-container">

<pre class="src src-java">class Person implements Serializable{
  private Person one;
  private Person two;
  public Couple(Person a, Person b){
    one = a;
    two = b;
  }
}
</pre>
</div>

<p>
Couple { {"Smith","London",1934} , {"Jones","Paris",1945} } will be serialized as:
</p>
<ul class="org-ul">
<li>Couple
</li>
<li>8 byte version number
</li>
<li>h0
</li>
<li>2
</li>
<li>Person one
</li>
<li>Person two
</li>
<li>Person
</li>
<li>8 byte version number
</li>
<li>h1
</li>
<li>3
</li>
<li>int year
</li>
<li>java.lang.String name
</li>
<li>java.lang.String place
</li>
<li>1934
</li>
<li>5 Smith
</li>
<li>6 London
</li>
<li>h2
</li>
<li>1945
</li>
<li>5 Jones
</li>
<li>5 Paris
</li>
<li>h3
</li>
<li>h4
</li>
</ul>
</div>
</div>
</div>
