CZ4013/summary.org
**** Validity
Message reaches destination
**** Integrity
- Message received = message sent
- Received only once
*** UDP
**** Features
- no ack or retries
- fragmentation for message larger than max
- not reliable
  - integrity
    - checksum
  - no validity
    - communication omission failure
- for quick response, can assume reliability, manual fault handling
**** Goal
To build reliable protocol over UDP:
- use timeout
  - solve lost request problem
  - but lost reply may imply more than once execution if operation is non-idempotent
- use requestID to filter out duplicates

*** TCP
**** Features
- abstraction of reliable stream
  - connection-oriented
    - setup connection before data transfer
  - ack and retries
  - tranparent message size segmentation
- reliable
  - integrity
    - checksum
    - sequence number
  - validity
    - ack
    - timeouts
- overhead
  - store state info
  - transmission overhead
  - latency from connection setup
**** Goal
To reduce of overhead of protocols over TCP:
- send requests and replies over same connection
  - avoid multiple TCP slow-starts
  - amortize connection establishment overhad
* Distributed Objects & Remote Invocation
** Object Model
consists of a collection of interacting objects
- communicate by invoking methods
- to invoke a method, need...
    - object reference
    - method name
    - arguments
- interface defines method signatures
    - definitions only
    - no implementation
    - implementation can be changed without changing interface
- exceptions:
    - errors
    - unexpected conditions
** Distributed Object Model
*** Description
- servers manage objects, clients invoke methods w/ RMI
- remote method invocation
  - between objects in different processes
- local method invocation
  - between objects in same process
- remote objects
  - objects that can receive remote invocations
- to invoke a method, need
  - remote object reference
    - created by server
    - obtained by client to access object
  - method name
  - arguments
- remote interface
  - specifies methods that can be invoked remotely
  - defined by
    - Java interface
    - CORBA Interface Definition Language (IDL)
- exception raised by RMI due to
  - distribution
    - timeouts
    - lost messages
  - method exceptions

*** Invocation Semantics
**** Maybe
- No retransmission
- If result, server executed method.
- If no result,
  - communication omission failure
    - request lost
      - not executed
    - reply lost
      - executed
  - process omission failure
    - executed/not executed
- e.g. CORBA for void methods
**** At-least-once
- Retransmission
- If result, server executed method \geq1x
- If no result, ??
- Acceptable if idempotent
- e.g. Sun RPC
**** At-most-once
- Retransmission and duplicate-filtering
- If result, server executed method 1x
- If no result, \leq1x
- e.g. Java RMI and CORBA
** Architecture of RMI
*** Proxy
- 1 proxy foreach class of remote object reference
- proxy implements methods in remote interface
  - transparency of RMI
- marshals arguments and unmarshals results
*** Communication Modules
- transmit request/reply
- e.g. messageType + requestID + remoteObjectReference + methodID + arguments
*** Skeleton
- 1 skeleton foreach class of remote object
- implements methods in remote interface
- unmarshals arguments, invokes method, marshals results
*** Binder
- name service that maintains mappings
  - object name \rightarrow remote object references
- server register remote objects by name in binders
- clients look up references
*** Description
- proxy and skeleton automatically generated by interface compiler
  - Java \rightarrow Java RMI compiler
  - CORBA \rightarrow use interface compiler
- server
  - skeleton
  - real implementation of methods
- client
  - proxy

For client to obtain RMI,
- remote object references may not be available at programming
- object names in text form are more convenient
** Java RMI Example
*** Polling
**** Architecture
***** Servant
Implement methods in remote interface
***** Server
- create remote objects
- register them in RMIregistry
***** Client
Lookup remote objects and access them
**** RMI registry
Binder for Java RMI
- map URL-style names \rightarrow remote object reference
- an instance of RMIregistry must run on each server
- two cases:
  - shared by all servers of different remote objects on same host (port 1099)
  - 1 registry per server, each different port
**** Implementation
