CZ4013/summary.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Client-Server Communication</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Reliability</h4>
<div class="outline-text-4" id="text-3-2-1">
</div><ol class="org-ol"><li><a id="sec-3-2-1-1" name="sec-3-2-1-1"></a>Validity<br  /><div class="outline-text-5" id="text-3-2-1-1">
<p>
Message reaches destination
</p>
</div>
</li>
<li><a id="sec-3-2-1-2" name="sec-3-2-1-2"></a>Integrity<br  /><div class="outline-text-5" id="text-3-2-1-2">
<ul class="org-ul">
<li>Message received = message sent
</li>
<li>Received only once
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> UDP</h4>
<div class="outline-text-4" id="text-3-2-2">
</div><ol class="org-ol"><li><a id="sec-3-2-2-1" name="sec-3-2-2-1"></a>Features<br  /><div class="outline-text-5" id="text-3-2-2-1">
<ul class="org-ul">
<li>no ack or retries
</li>
<li>fragmentation for message larger than max
</li>
<li>not reliable
<ul class="org-ul">
<li>integrity
<ul class="org-ul">
<li>checksum
</li>
</ul>
</li>
<li>no validity
<ul class="org-ul">
<li>communication omission failure
</li>
</ul>
</li>
</ul>
</li>
<li>for quick response, can assume reliability, manual fault handling
</li>
</ul>
</div>
</li>
<li><a id="sec-3-2-2-2" name="sec-3-2-2-2"></a>Goal<br  /><div class="outline-text-5" id="text-3-2-2-2">
<p>
To build reliable protocol over UDP:
</p>
<ul class="org-ul">
<li>use timeout
<ul class="org-ul">
<li>solve lost request problem
</li>
<li>but lost reply may imply more than once execution if operation is non-idempotent
</li>
</ul>
</li>
<li>use requestID to filter out duplicates
</li>
</ul>
</div>
</li></ol>
</div>

<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> TCP</h4>
<div class="outline-text-4" id="text-3-2-3">
</div><ol class="org-ol"><li><a id="sec-3-2-3-1" name="sec-3-2-3-1"></a>Features<br  /><div class="outline-text-5" id="text-3-2-3-1">
<ul class="org-ul">
<li>abstraction of reliable stream
<ul class="org-ul">
<li>connection-oriented
<ul class="org-ul">
<li>setup connection before data transfer
</li>
</ul>
</li>
<li>ack and retries
</li>
<li>tranparent message size segmentation
</li>
</ul>
</li>
<li>reliable
<ul class="org-ul">
<li>integrity
<ul class="org-ul">
<li>checksum
</li>
<li>sequence number
</li>
</ul>
</li>
<li>validity
<ul class="org-ul">
<li>ack
</li>
<li>timeouts
</li>
</ul>
</li>
</ul>
</li>
<li>overhead
<ul class="org-ul">
<li>store state info
</li>
<li>transmission overhead
</li>
<li>latency from connection setup
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-3-2-3-2" name="sec-3-2-3-2"></a>Goal<br  /><div class="outline-text-5" id="text-3-2-3-2">
<p>
To reduce of overhead of protocols over TCP:
</p>
<ul class="org-ul">
<li>send requests and replies over same connection
<ul class="org-ul">
<li>avoid multiple TCP slow-starts
</li>
<li>amortize connection establishment overhad
</li>
</ul>
</li>
</ul>
</div>
</li></ol>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Distributed Objects &amp; Remote Invocation</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Object Model</h3>
<div class="outline-text-3" id="text-4-1">
<p>
consists of a collection of interacting objects
</p>
<ul class="org-ul">
<li>communicate by invoking methods
</li>
<li>to invoke a method, need&#x2026;
<ul class="org-ul">
<li>object reference
</li>
<li>method name
</li>
<li>arguments
</li>
</ul>
</li>
<li>interface defines method signatures
<ul class="org-ul">
<li>definitions only
</li>
<li>no implementation
</li>
<li>implementation can be changed without changing interface
</li>
</ul>
</li>
<li>exceptions:
<ul class="org-ul">
<li>errors
</li>
<li>unexpected conditions
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Distributed Object Model</h3>
<div class="outline-text-3" id="text-4-2">
</div><div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Description</h4>
<div class="outline-text-4" id="text-4-2-1">
<ul class="org-ul">
<li>servers manage objects, clients invoke methods w/ RMI
</li>
<li>remote method invocation
<ul class="org-ul">
<li>between objects in different processes
</li>
</ul>
</li>
<li>local method invocation
<ul class="org-ul">
<li>between objects in same process
</li>
</ul>
</li>
<li>remote objects
<ul class="org-ul">
<li>objects that can receive remote invocations
</li>
</ul>
</li>
<li>to invoke a method, need
<ul class="org-ul">
<li>remote object reference
<ul class="org-ul">
<li>created by server
</li>
<li>obtained by client to access object
</li>
</ul>
</li>
<li>method name
</li>
<li>arguments
</li>
</ul>
</li>
<li>remote interface
<ul class="org-ul">
<li>specifies methods that can be invoked remotely
</li>
<li>defined by
<ul class="org-ul">
<li>Java interface
</li>
<li>CORBA Interface Definition Language (IDL)
</li>
</ul>
</li>
</ul>
</li>
<li>exception raised by RMI due to
<ul class="org-ul">
<li>distribution
<ul class="org-ul">
<li>timeouts
</li>
<li>lost messages
</li>
</ul>
</li>
<li>method exceptions
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> Invocation Semantics</h4>
<div class="outline-text-4" id="text-4-2-2">
</div><ol class="org-ol"><li><a id="sec-4-2-2-1" name="sec-4-2-2-1"></a>Maybe<br  /><div class="outline-text-5" id="text-4-2-2-1">
<ul class="org-ul">
<li>No retransmission
</li>
<li>If result, server executed method.
</li>
<li>If no result,
<ul class="org-ul">
<li>communication omission failure
<ul class="org-ul">
<li>request lost
<ul class="org-ul">
<li>not executed
</li>
</ul>
</li>
<li>reply lost
<ul class="org-ul">
<li>executed
</li>
</ul>
</li>
</ul>
</li>
<li>process omission failure
<ul class="org-ul">
<li>executed/not executed
</li>
</ul>
</li>
</ul>
</li>
<li>e.g. CORBA for void methods
</li>
</ul>
</div>
</li>
<li><a id="sec-4-2-2-2" name="sec-4-2-2-2"></a>At-least-once<br  /><div class="outline-text-5" id="text-4-2-2-2">
<ul class="org-ul">
<li>Retransmission
</li>
<li>If result, server executed method &ge;1x
</li>
<li>If no result, ??
</li>
<li>Acceptable if idempotent
</li>
<li>e.g. Sun RPC
</li>
</ul>
</div>
</li>
<li><a id="sec-4-2-2-3" name="sec-4-2-2-3"></a>At-most-once<br  /><div class="outline-text-5" id="text-4-2-2-3">
<ul class="org-ul">
<li>Retransmission and duplicate-filtering
</li>
<li>If result, server executed method 1x
</li>
<li>If no result, &le;1x
</li>
<li>e.g. Java RMI and CORBA
</li>
</ul>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Architecture of RMI</h3>
<div class="outline-text-3" id="text-4-3">
</div><div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> Proxy</h4>
<div class="outline-text-4" id="text-4-3-1">
<ul class="org-ul">
<li>1 proxy foreach class of remote object reference
</li>
<li>proxy implements methods in remote interface
<ul class="org-ul">
<li>transparency of RMI
</li>
</ul>
</li>
<li>marshals arguments and unmarshals results
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> Communication Modules</h4>
<div class="outline-text-4" id="text-4-3-2">
<ul class="org-ul">
<li>transmit request/reply
</li>
<li>e.g. messageType + requestID + remoteObjectReference + methodID + arguments
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-3-3" class="outline-4">
<h4 id="sec-4-3-3"><span class="section-number-4">4.3.3</span> Skeleton</h4>
<div class="outline-text-4" id="text-4-3-3">
<ul class="org-ul">
<li>1 skeleton foreach class of remote object
</li>
<li>implements methods in remote interface
</li>
<li>unmarshals arguments, invokes method, marshals results
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-3-4" class="outline-4">
<h4 id="sec-4-3-4"><span class="section-number-4">4.3.4</span> Binder</h4>
<div class="outline-text-4" id="text-4-3-4">
<ul class="org-ul">
<li>name service that maintains mappings
<ul class="org-ul">
<li>object name &rarr; remote object references
</li>
</ul>
</li>
<li>server register remote objects by name in binders
</li>
<li>clients look up references
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-3-5" class="outline-4">
<h4 id="sec-4-3-5"><span class="section-number-4">4.3.5</span> Description</h4>
<div class="outline-text-4" id="text-4-3-5">
<ul class="org-ul">
<li>proxy and skeleton automatically generated by interface compiler
<ul class="org-ul">
<li>Java &rarr; Java RMI compiler
</li>
<li>CORBA &rarr; use interface compiler
</li>
</ul>
</li>
<li>server
<ul class="org-ul">
<li>skeleton
</li>
<li>real implementation of methods
</li>
</ul>
</li>
<li>client
<ul class="org-ul">
<li>proxy
</li>
</ul>
</li>
</ul>

<p>
For client to obtain RMI,
</p>
<ul class="org-ul">
<li>remote object references may not be available at programming
</li>
<li>object names in text form are more convenient
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Java RMI Example</h3>
<div class="outline-text-3" id="text-4-4">
</div><div id="outline-container-sec-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><span class="section-number-4">4.4.1</span> Polling</h4>
<div class="outline-text-4" id="text-4-4-1">
</div><ol class="org-ol"><li><a id="sec-4-4-1-1" name="sec-4-4-1-1"></a>Architecture<br  /><ol class="org-ol"><li><a id="sec-4-4-1-1-1" name="sec-4-4-1-1-1"></a>Servant<br  /><div class="outline-text-6" id="text-4-4-1-1-1">
<p>
Implement methods in remote interface
</p>
</div>
</li>
<li><a id="sec-4-4-1-1-2" name="sec-4-4-1-1-2"></a>Server<br  /><div class="outline-text-6" id="text-4-4-1-1-2">
<ul class="org-ul">
<li>create remote objects
</li>
<li>register them in RMIregistry
</li>
</ul>
</div>
</li>
<li><a id="sec-4-4-1-1-3" name="sec-4-4-1-1-3"></a>Client<br  /><div class="outline-text-6" id="text-4-4-1-1-3">
<p>
Lookup remote objects and access them
</p>
</div>
</li></ol>
</li>
<li><a id="sec-4-4-1-2" name="sec-4-4-1-2"></a>RMI registry<br  /><div class="outline-text-5" id="text-4-4-1-2">
<p>
Binder for Java RMI
</p>
<ul class="org-ul">
<li>map URL-style names &rarr; remote object reference
</li>
<li>an instance of RMIregistry must run on each server
</li>
<li>two cases:
<ul class="org-ul">
<li>shared by all servers of different remote objects on same host (port 1099)
</li>
<li>1 registry per server, each different port
</li>
</ul>
</li>
</ul>
</div>
</li>
