CZ4013/summary.org
***** How to compile
1. Compile remote interface
   - generate proxies
   - generate skeletons
2. Compile source codes
3. Start server
4. Start client
***** Example 1
- Remote interface
#+BEGIN_SRC java
import java.rmi.*;

public interface City extends Remote{
  int getPopulation(String x) throws RemoteException;
}
#+END_SRC

- Servant class
#+BEGIN_SRC java
import java.rmi.*;
import java.rmi.server.*;

public class CityImpl extends UnicastRemoteObject implements City{
  public CityImpl throws RemoteException{
    super();
  }
  public int getPopulation(String x) throws RemoteException{
  
  }
}
#+END_SRC
- Server class
#+BEGIN_SRC java
import java.rmi.*;
import java.rmi.server.*;

public class CityServer{
  public static void main(String args[]){
    try{
      CityImpl ci = new CityImpl();
      Naming.rebind("rmi://.../City",ci);
    }catch(Exception e){}
  }
}
#+END_SRC

- Client class
#+BEGIN_SRC java
import java.rmi.*;

public class CityClient{
  public static void main(String args[]){
    try{
      City c = (City) Naming.lookup("rmi://.../City");
      c.getPopulation("Toronto");
    }
    catch (RemoteException e){}
    catch (Exception e){}
  }
}
#+END_SRC

*** Callback
Server informs when updated.
How to implement?
- client creates callback remote object
#+BEGIN_SRC java
public interface Callback extends Remote{
  void cbMethod() throws RemoteException;
}
#+END_SRC
- server provides ~register(Callback cb)~ and ~deregister(Callback cb)~
#+BEGIN_SRC java
void register(Callback cbObject) throws RemoteException;
void deregister(Callback cbObject) throws RemoteException;
#+END_SRC
- when event occurs, server invokes method in ~Callback~
* Distributed File Systems
** Introduction
*** File System
- allow multiple clients to share access to files
- provides API to programmers

Elements:
- files
  - contain data and attributes
- directories
  - special types of files
  - mapping: text names \rightarrow internal file identifiers
  - serve as folders of files
  - form hierarchical structure
*** Distributed File System
**** Features
- support file accesses throughout an intranet
- new features
  - distributed naming and location
  - component to deal with client-server communication
**** Requirements
***** Transparency
- access
  - same interface for accesses to local & remote files
- location
  - uniform file name space
***** File replication & consistency maintenance
- to improve performance and enhance scalability
- enhance fault tolerance
- thus need to maintain consistency
***** Fault tolerance
****** Stateful
- remembers client's previous operations
- inter-dependent requests
- heavier server demand
- difficult setup and recovery on crashes
  - server must restore/notify after restart
  - server must detect client crashes and discard states
****** Stateless
- untracked independent self-contained requests
- easy setup and restore
- less burden
- heavier network demand
** Sun NFS
*** Overview
- access transparency
  - apps use same file operations for both local & remote
- no location tranparency
  - different clients can mount server dir to different local dirs
- stateless servers and idempotent operations
  - no need to recover state
  - server unaffected by client failure
- approximate one-copy update semantics
*** Architecture
- symmetric client-server relationship
  - each computer in network can act both as client/server
- OS independent design
- files are accessed by means of file IDs
  - file IDs is reference to file in the FS
  - file IDs are called file handles in NFS
    - FS ID
    - ID for file in FS
*** Client-Server Communication
**** NFS Server Interface
- operations used by NFS client in RPC
- not used directly by user programs
- stateles and idempotent operations
  - no open close and RW pointer
  - self contained
**** NFS Client
- supply interface suitable for use by conventional programs
  - emulates UNIX FS emantics
- transfer blocks of files to/from NFS servers
**** Mount Service
***** Overview
- server exports FS
  - mount service process runs
  - ~/etc/exports~:
    - names of local FS available for remote mounting
    - hosts permitted to mount
- client mounts FS
  - use modified UNIX mount to request mounting
    - remote host name
    - pathname in remote FS
    - local name
  - communicates with mount service using RPC protocol
    - request: remote dir pathname to server
    - reply: file handle of dir
  - maintains table of mounted FS
  - NFS doesn't enforce single network-wide file namespace
    - can assign different local names to remote directory
***** Pathname Translation
Suppose ~/~ of remote server is mounted. To access ~/bin/draw/readme~:
1. ~binfh = lookup(rootfh,"bin")~
2. ~drawfh = lookup(binfh,"draw")~
3. ~readmefh = lookup(drawfh,"readme")~
Efficiency can be improved by caching.
