CZ4013/summary.html
<li><a id="sec-4-4-1-3" name="sec-4-4-1-3"></a>Implementation<br  /><ol class="org-ol"><li><a id="sec-4-4-1-3-1" name="sec-4-4-1-3-1"></a>How to compile<br  /><div class="outline-text-6" id="text-4-4-1-3-1">
<ol class="org-ol">
<li>Compile remote interface
<ul class="org-ul">
<li>generate proxies
</li>
<li>generate skeletons
</li>
</ul>
</li>
<li>Compile source codes
</li>
<li>Start server
</li>
<li>Start client
</li>
</ol>
</div>
</li>
<li><a id="sec-4-4-1-3-2" name="sec-4-4-1-3-2"></a>Example 1<br  /><div class="outline-text-6" id="text-4-4-1-3-2">
<ul class="org-ul">
<li>Remote interface
</li>
</ul>
<div class="org-src-container">

<pre class="src src-java">import java.rmi.*;

public interface City extends Remote{
  int getPopulation(String x) throws RemoteException;
}
</pre>
</div>

<ul class="org-ul">
<li>Servant class
</li>
</ul>
<div class="org-src-container">

<pre class="src src-java">import java.rmi.*;
import java.rmi.server.*;

public class CityImpl extends UnicastRemoteObject implements City{
  public CityImpl throws RemoteException{
    super();
  }
  public int getPopulation(String x) throws RemoteException{

  }
}
</pre>
</div>
<ul class="org-ul">
<li>Server class
</li>
</ul>
<div class="org-src-container">

<pre class="src src-java">import java.rmi.*;
import java.rmi.server.*;

public class CityServer{
  public static void main(String args[]){
    try{
      CityImpl ci = new CityImpl();
      Naming.rebind("rmi://.../City",ci);
    }catch(Exception e){}
  }
}
</pre>
</div>

<ul class="org-ul">
<li>Client class
</li>
</ul>
<div class="org-src-container">

<pre class="src src-java">import java.rmi.*;

public class CityClient{
  public static void main(String args[]){
    try{
      City c = (City) Naming.lookup("rmi://.../City");
      c.getPopulation("Toronto");
    }
    catch (RemoteException e){}
    catch (Exception e){}
  }
}
</pre>
</div>
</div>
</li></ol>
</li></ol>
</div>

<div id="outline-container-sec-4-4-2" class="outline-4">
<h4 id="sec-4-4-2"><span class="section-number-4">4.4.2</span> Callback</h4>
<div class="outline-text-4" id="text-4-4-2">
<p>
Server informs when updated.
How to implement?
</p>
<ul class="org-ul">
<li>client creates callback remote object
</li>
</ul>
<div class="org-src-container">

<pre class="src src-java">public interface Callback extends Remote{
  void cbMethod() throws RemoteException;
}
</pre>
</div>
<ul class="org-ul">
<li>server provides <code>register(Callback cb)</code> and <code>deregister(Callback cb)</code>
</li>
</ul>
<div class="org-src-container">

<pre class="src src-java">void register(Callback cbObject) throws RemoteException;
void deregister(Callback cbObject) throws RemoteException;
</pre>
</div>
<ul class="org-ul">
<li>when event occurs, server invokes method in <code>Callback</code>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Distributed File Systems</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Introduction</h3>
<div class="outline-text-3" id="text-5-1">
</div><div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> File System</h4>
<div class="outline-text-4" id="text-5-1-1">
<ul class="org-ul">
<li>allow multiple clients to share access to files
</li>
<li>provides API to programmers
</li>
</ul>

<p>
Elements:
</p>
<ul class="org-ul">
<li>files
<ul class="org-ul">
<li>contain data and attributes
</li>
</ul>
</li>
<li>directories
<ul class="org-ul">
<li>special types of files
</li>
<li>mapping: text names &rarr; internal file identifiers
</li>
<li>serve as folders of files
</li>
<li>form hierarchical structure
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="section-number-4">5.1.2</span> Distributed File System</h4>
<div class="outline-text-4" id="text-5-1-2">
</div><ol class="org-ol"><li><a id="sec-5-1-2-1" name="sec-5-1-2-1"></a>Features<br  /><div class="outline-text-5" id="text-5-1-2-1">
<ul class="org-ul">
<li>support file accesses throughout an intranet
</li>
<li>new features
<ul class="org-ul">
<li>distributed naming and location
</li>
<li>component to deal with client-server communication
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-5-1-2-2" name="sec-5-1-2-2"></a>Requirements<br  /><ol class="org-ol"><li><a id="sec-5-1-2-2-1" name="sec-5-1-2-2-1"></a>Transparency<br  /><div class="outline-text-6" id="text-5-1-2-2-1">
<ul class="org-ul">
<li>access
<ul class="org-ul">
<li>same interface for accesses to local &amp; remote files
</li>
</ul>
</li>
<li>location
<ul class="org-ul">
<li>uniform file name space
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-5-1-2-2-2" name="sec-5-1-2-2-2"></a>File replication &amp; consistency maintenance<br  /><div class="outline-text-6" id="text-5-1-2-2-2">
<ul class="org-ul">
<li>to improve performance and enhance scalability
</li>
<li>enhance fault tolerance
</li>
<li>thus need to maintain consistency
</li>
</ul>
</div>
</li>
<li><a id="sec-5-1-2-2-3" name="sec-5-1-2-2-3"></a>Fault tolerance<br  /><ol class="org-ol"><li><a id="sec-5-1-2-2-3-1" name="sec-5-1-2-2-3-1"></a>Stateful<br  /><div class="outline-text-7" id="text-5-1-2-2-3-1">
<ul class="org-ul">
<li>remembers client's previous operations
</li>
<li>inter-dependent requests
</li>
<li>heavier server demand
</li>
<li>difficult setup and recovery on crashes
<ul class="org-ul">
<li>server must restore/notify after restart
</li>
<li>server must detect client crashes and discard states
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-5-1-2-2-3-2" name="sec-5-1-2-2-3-2"></a>Stateless<br  /><div class="outline-text-7" id="text-5-1-2-2-3-2">
<ul class="org-ul">
<li>untracked independent self-contained requests
</li>
<li>easy setup and restore
</li>
<li>less burden
</li>
<li>heavier network demand
</li>
</ul>
</div>
</li></ol>
</li></ol>
</li></ol>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Sun NFS</h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="outline-container-sec-5-2-1" class="outline-4">
<h4 id="sec-5-2-1"><span class="section-number-4">5.2.1</span> Overview</h4>
<div class="outline-text-4" id="text-5-2-1">
<ul class="org-ul">
<li>access transparency
<ul class="org-ul">
<li>apps use same file operations for both local &amp; remote
</li>
</ul>
</li>
<li>no location tranparency
<ul class="org-ul">
<li>different clients can mount server dir to different local dirs
</li>
</ul>
</li>
<li>stateless servers and idempotent operations
<ul class="org-ul">
<li>no need to recover state
</li>
<li>server unaffected by client failure
</li>
</ul>
</li>
<li>approximate one-copy update semantics
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-2-2" class="outline-4">
<h4 id="sec-5-2-2"><span class="section-number-4">5.2.2</span> Architecture</h4>
<div class="outline-text-4" id="text-5-2-2">
<ul class="org-ul">
<li>symmetric client-server relationship
<ul class="org-ul">
<li>each computer in network can act both as client/server
</li>
</ul>
</li>
<li>OS independent design
</li>
<li>files are accessed by means of file IDs
<ul class="org-ul">
<li>file IDs is reference to file in the FS
</li>
<li>file IDs are called file handles in NFS
<ul class="org-ul">
<li>FS ID
</li>
<li>ID for file in FS
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-2-3" class="outline-4">
<h4 id="sec-5-2-3"><span class="section-number-4">5.2.3</span> Client-Server Communication</h4>
<div class="outline-text-4" id="text-5-2-3">
</div><ol class="org-ol"><li><a id="sec-5-2-3-1" name="sec-5-2-3-1"></a>NFS Server Interface<br  /><div class="outline-text-5" id="text-5-2-3-1">
<ul class="org-ul">
<li>operations used by NFS client in RPC
</li>
<li>not used directly by user programs
</li>
<li>stateles and idempotent operations
<ul class="org-ul">
<li>no open close and RW pointer
</li>
<li>self contained
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-5-2-3-2" name="sec-5-2-3-2"></a>NFS Client<br  /><div class="outline-text-5" id="text-5-2-3-2">
<ul class="org-ul">
<li>supply interface suitable for use by conventional programs
<ul class="org-ul">
<li>emulates UNIX FS emantics
</li>
</ul>
</li>
<li>transfer blocks of files to/from NFS servers
</li>
</ul>
</div>
</li>
<li><a id="sec-5-2-3-3" name="sec-5-2-3-3"></a>Mount Service<br  /><ol class="org-ol"><li><a id="sec-5-2-3-3-1" name="sec-5-2-3-3-1"></a>Overview<br  /><div class="outline-text-6" id="text-5-2-3-3-1">
<ul class="org-ul">
<li>server exports FS
<ul class="org-ul">
<li>mount service process runs
</li>
<li><code>/etc/exports</code>:
<ul class="org-ul">
<li>names of local FS available for remote mounting
</li>
<li>hosts permitted to mount
</li>
</ul>
</li>
</ul>
</li>
<li>client mounts FS
<ul class="org-ul">
<li>use modified UNIX mount to request mounting
<ul class="org-ul">
<li>remote host name
</li>
<li>pathname in remote FS
</li>
<li>local name
</li>
</ul>
</li>
<li>communicates with mount service using RPC protocol
<ul class="org-ul">
<li>request: remote dir pathname to server
</li>
<li>reply: file handle of dir
</li>
</ul>
</li>
<li>maintains table of mounted FS
</li>
<li>NFS doesn't enforce single network-wide file namespace
<ul class="org-ul">
<li>can assign different local names to remote directory
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-5-2-3-3-2" name="sec-5-2-3-3-2"></a>Pathname Translation<br  /><div class="outline-text-6" id="text-5-2-3-3-2">
<p>
Suppose <code>/</code> of remote server is mounted. To access <code>/bin/draw/readme</code>:
</p>
<ol class="org-ol">
<li><code>binfh = lookup(rootfh,"bin")</code>
</li>
<li><code>drawfh = lookup(binfh,"draw")</code>
</li>
<li><code>readmefh = lookup(drawfh,"readme")</code>
</li>
</ol>
<p>
Efficiency can be improved by caching.
</p>
</div>
</li></ol>
</li></ol>
</div>
