CZ4013/summary.org
*** Client Caching
- caches results of RW etc
  - to reduce communication with server
  - block granularity
  - mainly in main memory
- comparison
  - local systems
    - one-copy update semantics
      - when file modified, all other clients see updates immediately
  - distributed systems
    - approximation to one-copy update semantics
- writes by client do not result in immediate updating of cached copies of same file in other clients
- potentially different versions of files across different clients
- to maintain consistency, clients should poll server
- cache is fresh when ~T-Tc < t~
- otherwise, need to poll validity

** AFS and Code File Systems
*** Overview
- access transparency
- high location transparency
- stateful
- relaxed consistency through session update semantics
- scalable
*** AFS Architecture
**** Features
- scalable
- two partitions of nodes
  - dedicated file servers
  - large number of clients
- similar to NFS
  - access to files via normal UNIX operations
  - venus clients and vice servers communicate using RPC
  - user programs use conventional UNIX pathnames to refer to files
  - venus translates pathnames into file IDs using step-by-step lookups from dirs in vice servers
  - files accesses by the obtained file IDs
**** Shared File Namespace
- shared file namespace
  - vice servers maintain global shared file namespace
  - venus clients follow
- clients have access to shared namespace by special local subdir e.g. /afs
  - client access file in /afs/ \rightarrow venus ensures appropriate part mounted
  - when mounting, venus ensures naming graph rooted at this subdir is always subgraph of complete shared namespace maintained by vice servers
  - shared files have same pathname
**** Volume
- easy replication, location, movement
  - basic unit of mounting and replication
  - smaller than UNIX FS
  - volume = partial subtree in shared namespace maintain by vice servers
**** Replication
- each file is contained in =1 logical volume
- volume may be replicated
- each logical volume is associated with a RVID
  - location and replication independent
- each physical volume has own VID
  - location dependent
- each shared file is identified by file ID
  - RVID + file handle
- consistency
  - read-one, write-all
**** Location
- Volume replication DB
  - RVID \rightarrow VIDs
- Volume location DB
  - VID \rightarrow server
So the file ID is transformed from RVID + file handle to Server + file handle after being passed to Volume replication DB and Volume location DB. Databases are fully replicated at each server.
*** Whole-File Serving and Caching
**** Typical UNIX Workloads
- Read more than write
- Entire, sequential file access
- Most files accessed only by one user
- Files are referenced in bursts (temporal locality)

**** Strategy
- Whole-file serving
  - entire files transmitted to clients
- Whole-file caching
  - transferred files are stored in cache
**** How it works
- Open \rightarrow entire file transmitted to client
- RWs performed on local copy
- Close \rightarrow client transmits updates to server, retain copy
**** Session update semantics
We relax the one-copy update semantics to reduce network traffic, performance degradation, be more scalable.

In session update semantics, all other clients are able to see a modified file only after the file is closed by the client that modified it.
**** Cache Consistency
***** Method
- foreach file, 
  - server keeps track which clients have copy of it
  - notify clients when file modified
***** Callback mechanism
- callback promise
  - valid: cache is fresh
  - cancelled: cache is out-of-date
- opening file
  - if not cached, fetch file and promise
  - if cached and valid, open local copy
  - if cached and cancelled, fetch copy and update promise
- closing file
  - if modified, send updates to server
- server
  - if file f is modified
    - foreach client holding valid cache of f
      - set client promise to cancelled
      - remove client from list of valid clients
***** Problem
If multiple clients write to a file concurrently, all updates are silently lost except those made by last client. Concurrency control must be implemented independently.
*** Coda File System
**** Overview
- designed to have high availability
  - client can continue operation when disconnected
- disconnected w.r.t. a volume: 
  - can't access any server having a copy of it
- ensure cache contains files to be accessed during disconnection
**** Hoarding
- ask user to specify useful files in a hoard DB
- compute priority from hoard DB + recent file access
- equlibrium
  - cached have higher priority than uncached
  - cache is full or all uncached have 0 priority
  - cached files are up-to-date
- priority may change overtime
- cached may be replaced
- periodically reorganize cache to maintain equilibrium
**** Client State
***** Hoarding
When connected, issue file requests to server(s) to perform work and attempts to keep cache filled with useful data
***** Emulation
When disconnected, requests are serviced using local copy
***** Reintegration
When reconnected, transfer updates to server
**** Conflicts
- during reintegration, conflicts may occur
- in such case, try conflict resolution
- if fail, manual intervention
- rare because UNIX \rightarrow only one user access a file
* P2P File Sharing Systems
