CZ4013/summary.html
<div id="outline-container-sec-5-2-4" class="outline-4">
<h4 id="sec-5-2-4"><span class="section-number-4">5.2.4</span> Client Caching</h4>
<div class="outline-text-4" id="text-5-2-4">
<ul class="org-ul">
<li>caches results of RW etc
<ul class="org-ul">
<li>to reduce communication with server
</li>
<li>block granularity
</li>
<li>mainly in main memory
</li>
</ul>
</li>
<li>comparison
<ul class="org-ul">
<li>local systems
<ul class="org-ul">
<li>one-copy update semantics
<ul class="org-ul">
<li>when file modified, all other clients see updates immediately
</li>
</ul>
</li>
</ul>
</li>
<li>distributed systems
<ul class="org-ul">
<li>approximation to one-copy update semantics
</li>
</ul>
</li>
</ul>
</li>
<li>writes by client do not result in immediate updating of cached copies of same file in other clients
</li>
<li>potentially different versions of files across different clients
</li>
<li>to maintain consistency, clients should poll server
</li>
<li>cache is fresh when <code>T-Tc &lt; t</code>
</li>
<li>otherwise, need to poll validity
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> AFS and Code File Systems</h3>
<div class="outline-text-3" id="text-5-3">
</div><div id="outline-container-sec-5-3-1" class="outline-4">
<h4 id="sec-5-3-1"><span class="section-number-4">5.3.1</span> Overview</h4>
<div class="outline-text-4" id="text-5-3-1">
<ul class="org-ul">
<li>access transparency
</li>
<li>high location transparency
</li>
<li>stateful
</li>
<li>relaxed consistency through session update semantics
</li>
<li>scalable
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-3-2" class="outline-4">
<h4 id="sec-5-3-2"><span class="section-number-4">5.3.2</span> AFS Architecture</h4>
<div class="outline-text-4" id="text-5-3-2">
</div><ol class="org-ol"><li><a id="sec-5-3-2-1" name="sec-5-3-2-1"></a>Features<br  /><div class="outline-text-5" id="text-5-3-2-1">
<ul class="org-ul">
<li>scalable
</li>
<li>two partitions of nodes
<ul class="org-ul">
<li>dedicated file servers
</li>
<li>large number of clients
</li>
</ul>
</li>
<li>similar to NFS
<ul class="org-ul">
<li>access to files via normal UNIX operations
</li>
<li>venus clients and vice servers communicate using RPC
</li>
<li>user programs use conventional UNIX pathnames to refer to files
</li>
<li>venus translates pathnames into file IDs using step-by-step lookups from dirs in vice servers
</li>
<li>files accesses by the obtained file IDs
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-5-3-2-2" name="sec-5-3-2-2"></a>Shared File Namespace<br  /><div class="outline-text-5" id="text-5-3-2-2">
<ul class="org-ul">
<li>shared file namespace
<ul class="org-ul">
<li>vice servers maintain global shared file namespace
</li>
<li>venus clients follow
</li>
</ul>
</li>
<li>clients have access to shared namespace by special local subdir e.g. /afs
<ul class="org-ul">
<li>client access file in <i>afs</i> &rarr; venus ensures appropriate part mounted
</li>
<li>when mounting, venus ensures naming graph rooted at this subdir is always subgraph of complete shared namespace maintained by vice servers
</li>
<li>shared files have same pathname
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-5-3-2-3" name="sec-5-3-2-3"></a>Volume<br  /><div class="outline-text-5" id="text-5-3-2-3">
<ul class="org-ul">
<li>easy replication, location, movement
<ul class="org-ul">
<li>basic unit of mounting and replication
</li>
<li>smaller than UNIX FS
</li>
<li>volume = partial subtree in shared namespace maintain by vice servers
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-5-3-2-4" name="sec-5-3-2-4"></a>Replication<br  /><div class="outline-text-5" id="text-5-3-2-4">
<ul class="org-ul">
<li>each file is contained in =1 logical volume
</li>
<li>volume may be replicated
</li>
<li>each logical volume is associated with a RVID
<ul class="org-ul">
<li>location and replication independent
</li>
</ul>
</li>
<li>each physical volume has own VID
<ul class="org-ul">
<li>location dependent
</li>
</ul>
</li>
<li>each shared file is identified by file ID
<ul class="org-ul">
<li>RVID + file handle
</li>
</ul>
</li>
<li>consistency
<ul class="org-ul">
<li>read-one, write-all
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-5-3-2-5" name="sec-5-3-2-5"></a>Location<br  /><div class="outline-text-5" id="text-5-3-2-5">
<ul class="org-ul">
<li>Volume replication DB
<ul class="org-ul">
<li>RVID &rarr; VIDs
</li>
</ul>
</li>
<li>Volume location DB
<ul class="org-ul">
<li>VID &rarr; server
</li>
</ul>
</li>
</ul>
<p>
So the file ID is transformed from RVID + file handle to Server + file handle after being passed to Volume replication DB and Volume location DB. Databases are fully replicated at each server.
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-5-3-3" class="outline-4">
<h4 id="sec-5-3-3"><span class="section-number-4">5.3.3</span> Whole-File Serving and Caching</h4>
<div class="outline-text-4" id="text-5-3-3">
</div><ol class="org-ol"><li><a id="sec-5-3-3-1" name="sec-5-3-3-1"></a>Typical UNIX Workloads<br  /><div class="outline-text-5" id="text-5-3-3-1">
<ul class="org-ul">
<li>Read more than write
</li>
<li>Entire, sequential file access
</li>
<li>Most files accessed only by one user
</li>
<li>Files are referenced in bursts (temporal locality)
</li>
</ul>
</div>
</li>

<li><a id="sec-5-3-3-2" name="sec-5-3-3-2"></a>Strategy<br  /><div class="outline-text-5" id="text-5-3-3-2">
<ul class="org-ul">
<li>Whole-file serving
<ul class="org-ul">
<li>entire files transmitted to clients
</li>
</ul>
</li>
<li>Whole-file caching
<ul class="org-ul">
<li>transferred files are stored in cache
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-5-3-3-3" name="sec-5-3-3-3"></a>How it works<br  /><div class="outline-text-5" id="text-5-3-3-3">
<ul class="org-ul">
<li>Open &rarr; entire file transmitted to client
</li>
<li>RWs performed on local copy
</li>
<li>Close &rarr; client transmits updates to server, retain copy
</li>
</ul>
</div>
</li>
<li><a id="sec-5-3-3-4" name="sec-5-3-3-4"></a>Session update semantics<br  /><div class="outline-text-5" id="text-5-3-3-4">
<p>
We relax the one-copy update semantics to reduce network traffic, performance degradation, be more scalable.
</p>

<p>
In session update semantics, all other clients are able to see a modified file only after the file is closed by the client that modified it.
</p>
</div>
</li>
<li><a id="sec-5-3-3-5" name="sec-5-3-3-5"></a>Cache Consistency<br  /><ol class="org-ol"><li><a id="sec-5-3-3-5-1" name="sec-5-3-3-5-1"></a>Method<br  /><div class="outline-text-6" id="text-5-3-3-5-1">
<ul class="org-ul">
<li>foreach file, 
<ul class="org-ul">
<li>server keeps track which clients have copy of it
</li>
<li>notify clients when file modified
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-5-3-3-5-2" name="sec-5-3-3-5-2"></a>Callback mechanism<br  /><div class="outline-text-6" id="text-5-3-3-5-2">
<ul class="org-ul">
<li>callback promise
<ul class="org-ul">
<li>valid: cache is fresh
</li>
<li>cancelled: cache is out-of-date
</li>
</ul>
</li>
<li>opening file
<ul class="org-ul">
<li>if not cached, fetch file and promise
</li>
<li>if cached and valid, open local copy
</li>
<li>if cached and cancelled, fetch copy and update promise
</li>
</ul>
</li>
<li>closing file
<ul class="org-ul">
<li>if modified, send updates to server
</li>
</ul>
</li>
<li>server
<ul class="org-ul">
<li>if file f is modified
<ul class="org-ul">
<li>foreach client holding valid cache of f
<ul class="org-ul">
<li>set client promise to cancelled
</li>
<li>remove client from list of valid clients
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-5-3-3-5-3" name="sec-5-3-3-5-3"></a>Problem<br  /><div class="outline-text-6" id="text-5-3-3-5-3">
<p>
If multiple clients write to a file concurrently, all updates are silently lost except those made by last client. Concurrency control must be implemented independently.
</p>
</div>
</li></ol>
</li></ol>
</div>
<div id="outline-container-sec-5-3-4" class="outline-4">
<h4 id="sec-5-3-4"><span class="section-number-4">5.3.4</span> Coda File System</h4>
<div class="outline-text-4" id="text-5-3-4">
</div><ol class="org-ol"><li><a id="sec-5-3-4-1" name="sec-5-3-4-1"></a>Overview<br  /><div class="outline-text-5" id="text-5-3-4-1">
<ul class="org-ul">
<li>designed to have high availability
<ul class="org-ul">
<li>client can continue operation when disconnected
</li>
</ul>
</li>
<li>disconnected w.r.t. a volume: 
<ul class="org-ul">
<li>can't access any server having a copy of it
</li>
</ul>
</li>
<li>ensure cache contains files to be accessed during disconnection
</li>
</ul>
</div>
</li>
<li><a id="sec-5-3-4-2" name="sec-5-3-4-2"></a>Hoarding<br  /><div class="outline-text-5" id="text-5-3-4-2">
<ul class="org-ul">
<li>ask user to specify useful files in a hoard DB
</li>
<li>compute priority from hoard DB + recent file access
</li>
<li>equlibrium
<ul class="org-ul">
<li>cached have higher priority than uncached
</li>
<li>cache is full or all uncached have 0 priority
</li>
<li>cached files are up-to-date
</li>
</ul>
</li>
<li>priority may change overtime
</li>
<li>cached may be replaced
</li>
<li>periodically reorganize cache to maintain equilibrium
</li>
</ul>
</div>
</li>
<li><a id="sec-5-3-4-3" name="sec-5-3-4-3"></a>Client State<br  /><ol class="org-ol"><li><a id="sec-5-3-4-3-1" name="sec-5-3-4-3-1"></a>Hoarding<br  /><div class="outline-text-6" id="text-5-3-4-3-1">
<p>
When connected, issue file requests to server(s) to perform work and attempts to keep cache filled with useful data
</p>
</div>
</li>
<li><a id="sec-5-3-4-3-2" name="sec-5-3-4-3-2"></a>Emulation<br  /><div class="outline-text-6" id="text-5-3-4-3-2">
<p>
When disconnected, requests are serviced using local copy
</p>
</div>
</li>
<li><a id="sec-5-3-4-3-3" name="sec-5-3-4-3-3"></a>Reintegration<br  /><div class="outline-text-6" id="text-5-3-4-3-3">
<p>
When reconnected, transfer updates to server
</p>
</div>
</li></ol>
</li>
<li><a id="sec-5-3-4-4" name="sec-5-3-4-4"></a>Conflicts<br  /><div class="outline-text-5" id="text-5-3-4-4">
<ul class="org-ul">
<li>during reintegration, conflicts may occur
</li>
<li>in such case, try conflict resolution
</li>
<li>if fail, manual intervention
</li>
<li>rare because UNIX &rarr; only one user access a file
</li>
</ul>
</div>
</li></ol>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> P2P File Sharing Systems</h2>
