CZ4013/summary.org
** Introduction
- All processes play similar roles, interact cooperatively
- No distinction between clients and servers
- Every node provides some service that helps other nodes
- Resources at edge have intermittent connectivity
  - Added and removed from time to time
** Examples
*** File sharing
- Napster
- Gnutella
- KaZaA
- BitTorrent
*** Communication
- IM
- Skype VoIP
*** DHT
- Chord
** Unstructured P2P File Sharing
*** Overview
- simple to build
- simple to understand
- can't analyse performance
  - new node randomly chooses exinting nodes when joins
  - no coupling
  - random search
  - what is expected overhead of search?
- need many copies to make search overhead small
*** Napster
**** Overview
- centralized dir server
  - centralized search
- P2P distributed download
**** Steps
1. Connect to Napster server
2. Upload list of files to server
3. Give keywords to search with
4. Select best answers for downloading. User pings hosts that have the wanted file
5. User chooses server and downloads file
*** Gnutella
**** Overview
- Search servers that have file you want by flooding
  - BFS
- Reverse path forwarding for responses
**** How it works
- limit number of hops
  - user attaches TTL field to query message and init it with max allowable hop count
  - for nodes receiving query,
    - if TTL > 0, TTL-- and forward
    - if TTL = 0, stop
- expanded-ring TTL search
  - try TTL = 1.
  - if not found, try TTL = 2
  - ...
  - try TTL = max
**** Connection
1. bootstrap node to get IP addresses of existing Gnutella nodes
2. send join messages to some existing nodes
3. relations established
**** Issues
- flooding is not scalable
- may generate huge traffic
- possibly incomplete downloads
- ineffective search
*** KaZaA
**** Architecture
- hierarchical
- each peer is either supernode or node assigned to supernode
- if more bandwidth and more available, assigned as supernodes
- each supernode tracks contents and IP address of its children
**** How it works
***** Metadata
- when node connects to supernode, upload metadata
- foreach file
  - file name, size
  - ContentHash
  - file descriptors
***** Connection
- get list of potential supernodes
- find operational supernode
  - connects, obtain more up-to-date list
  - supernodes are close
  - new peer pings 5 supernodes and connects to one
- if down, node obtains updated list and chooses new supernode
***** Query
1. send keyword query to supernode
2. if < x matches found, supernode forward
3. if < x matches found, forward
4. result: ContentHash and list of nodes holding file
***** Download
- if available in multiple nodes, parallel downloading
- automatic recovery
  - client peer switch to new server peer when unavailable
  - ContentHash is used to search for new copy
** Structured DHT Systems
*** Overview
- tight coupling between nodes and file locations
- assign nodes to hold particular contents
- want to distribute responsibilities among nodes
- when a node requests that content, go to node that is supposed to have/know about it
- arrange neighbour relationship between nodes in a restrictive structure to facilitate query routing
*** DHT Services
**** The Hash
- hash function:
  - files \rightarrow [0,k]
- distribute [0,k] among all nodes
- node [l,r] is responsible for files that are mapped into l \leq x \leq r
  - direct
    - physically store files
  - indirect
    - stores locations of files
**** Routing
- query efficiently routed to node whose range covers file
- implemented in fully distributed manner
- each node maintains info of range spaces covered by some other nodes
- complexity must scale with system growth
- gracefully handle node joining/leaving system
  - bootstrap to connect
  - repartition range on joining/leaving nodes
  - reorganize/update routing info
*** Consistent Hashing
- Range [0,2^m-1]
- Let ..p n s .. be among the graph. Let f(i) be the assigned number to node i. Then node n is responsible for nodes [f(p)+1 mod 2^m-1,f(n) mod 2^m-1].
- Each file is held in a node with node_id \geq file_id
**** Scheme 1
- each node maintains ID and IP of successor
- low complexity of routing info
- high complexity of query routing
**** Scheme 2
- each node maintains ID and IP of all nodes
- low complexity of query routing
- high complexity of routing info
*** Chord
**** Method
- each node maintains ID and IP of nodes in a finger table
- ~table[n][i]~ = ID and IP of first node that succeeds n by at least 2^(i-1) on ID circle
  - each entry called a finger
- suppose want to query key k at node n, then lookup the table[n][log2(k-n)+1]
- O(lgN) routing information, O(lgN) query routing
- query can always be routed correctly as long as each node knows its correct successor node
