CZ4013/summary.html
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Introduction</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>All processes play similar roles, interact cooperatively
</li>
<li>No distinction between clients and servers
</li>
<li>Every node provides some service that helps other nodes
</li>
<li>Resources at edge have intermittent connectivity
<ul class="org-ul">
<li>Added and removed from time to time
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Examples</h3>
<div class="outline-text-3" id="text-6-2">
</div><div id="outline-container-sec-6-2-1" class="outline-4">
<h4 id="sec-6-2-1"><span class="section-number-4">6.2.1</span> File sharing</h4>
<div class="outline-text-4" id="text-6-2-1">
<ul class="org-ul">
<li>Napster
</li>
<li>Gnutella
</li>
<li>KaZaA
</li>
<li>BitTorrent
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-2-2" class="outline-4">
<h4 id="sec-6-2-2"><span class="section-number-4">6.2.2</span> Communication</h4>
<div class="outline-text-4" id="text-6-2-2">
<ul class="org-ul">
<li>IM
</li>
<li>Skype VoIP
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-2-3" class="outline-4">
<h4 id="sec-6-2-3"><span class="section-number-4">6.2.3</span> DHT</h4>
<div class="outline-text-4" id="text-6-2-3">
<ul class="org-ul">
<li>Chord
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Unstructured P2P File Sharing</h3>
<div class="outline-text-3" id="text-6-3">
</div><div id="outline-container-sec-6-3-1" class="outline-4">
<h4 id="sec-6-3-1"><span class="section-number-4">6.3.1</span> Overview</h4>
<div class="outline-text-4" id="text-6-3-1">
<ul class="org-ul">
<li>simple to build
</li>
<li>simple to understand
</li>
<li>can't analyse performance
<ul class="org-ul">
<li>new node randomly chooses exinting nodes when joins
</li>
<li>no coupling
</li>
<li>random search
</li>
<li>what is expected overhead of search?
</li>
</ul>
</li>
<li>need many copies to make search overhead small
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-3-2" class="outline-4">
<h4 id="sec-6-3-2"><span class="section-number-4">6.3.2</span> Napster</h4>
<div class="outline-text-4" id="text-6-3-2">
</div><ol class="org-ol"><li><a id="sec-6-3-2-1" name="sec-6-3-2-1"></a>Overview<br  /><div class="outline-text-5" id="text-6-3-2-1">
<ul class="org-ul">
<li>centralized dir server
<ul class="org-ul">
<li>centralized search
</li>
</ul>
</li>
<li>P2P distributed download
</li>
</ul>
</div>
</li>
<li><a id="sec-6-3-2-2" name="sec-6-3-2-2"></a>Steps<br  /><div class="outline-text-5" id="text-6-3-2-2">
<ol class="org-ol">
<li>Connect to Napster server
</li>
<li>Upload list of files to server
</li>
<li>Give keywords to search with
</li>
<li>Select best answers for downloading. User pings hosts that have the wanted file
</li>
<li>User chooses server and downloads file
</li>
</ol>
</div>
</li></ol>
</div>
<div id="outline-container-sec-6-3-3" class="outline-4">
<h4 id="sec-6-3-3"><span class="section-number-4">6.3.3</span> Gnutella</h4>
<div class="outline-text-4" id="text-6-3-3">
</div><ol class="org-ol"><li><a id="sec-6-3-3-1" name="sec-6-3-3-1"></a>Overview<br  /><div class="outline-text-5" id="text-6-3-3-1">
<ul class="org-ul">
<li>Search servers that have file you want by flooding
<ul class="org-ul">
<li>BFS
</li>
</ul>
</li>
<li>Reverse path forwarding for responses
</li>
</ul>
</div>
</li>
<li><a id="sec-6-3-3-2" name="sec-6-3-3-2"></a>How it works<br  /><div class="outline-text-5" id="text-6-3-3-2">
<ul class="org-ul">
<li>limit number of hops
<ul class="org-ul">
<li>user attaches TTL field to query message and init it with max allowable hop count
</li>
<li>for nodes receiving query,
<ul class="org-ul">
<li>if TTL &gt; 0, TTL&#x2013; and forward
</li>
<li>if TTL = 0, stop
</li>
</ul>
</li>
</ul>
</li>
<li>expanded-ring TTL search
<ul class="org-ul">
<li>try TTL = 1.
</li>
<li>if not found, try TTL = 2
</li>
<li>&#x2026;
</li>
<li>try TTL = max
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-6-3-3-3" name="sec-6-3-3-3"></a>Connection<br  /><div class="outline-text-5" id="text-6-3-3-3">
<ol class="org-ol">
<li>bootstrap node to get IP addresses of existing Gnutella nodes
</li>
<li>send join messages to some existing nodes
</li>
<li>relations established
</li>
</ol>
</div>
</li>
<li><a id="sec-6-3-3-4" name="sec-6-3-3-4"></a>Issues<br  /><div class="outline-text-5" id="text-6-3-3-4">
<ul class="org-ul">
<li>flooding is not scalable
</li>
<li>may generate huge traffic
</li>
<li>possibly incomplete downloads
</li>
<li>ineffective search
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-6-3-4" class="outline-4">
<h4 id="sec-6-3-4"><span class="section-number-4">6.3.4</span> KaZaA</h4>
<div class="outline-text-4" id="text-6-3-4">
</div><ol class="org-ol"><li><a id="sec-6-3-4-1" name="sec-6-3-4-1"></a>Architecture<br  /><div class="outline-text-5" id="text-6-3-4-1">
<ul class="org-ul">
<li>hierarchical
</li>
<li>each peer is either supernode or node assigned to supernode
</li>
<li>if more bandwidth and more available, assigned as supernodes
</li>
<li>each supernode tracks contents and IP address of its children
</li>
</ul>
</div>
</li>
<li><a id="sec-6-3-4-2" name="sec-6-3-4-2"></a>How it works<br  /><ol class="org-ol"><li><a id="sec-6-3-4-2-1" name="sec-6-3-4-2-1"></a>Metadata<br  /><div class="outline-text-6" id="text-6-3-4-2-1">
<ul class="org-ul">
<li>when node connects to supernode, upload metadata
</li>
<li>foreach file
<ul class="org-ul">
<li>file name, size
</li>
<li>ContentHash
</li>
<li>file descriptors
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-6-3-4-2-2" name="sec-6-3-4-2-2"></a>Connection<br  /><div class="outline-text-6" id="text-6-3-4-2-2">
<ul class="org-ul">
<li>get list of potential supernodes
</li>
<li>find operational supernode
<ul class="org-ul">
<li>connects, obtain more up-to-date list
</li>
<li>supernodes are close
</li>
<li>new peer pings 5 supernodes and connects to one
</li>
</ul>
</li>
<li>if down, node obtains updated list and chooses new supernode
</li>
</ul>
</div>
</li>
<li><a id="sec-6-3-4-2-3" name="sec-6-3-4-2-3"></a>Query<br  /><div class="outline-text-6" id="text-6-3-4-2-3">
<ol class="org-ol">
<li>send keyword query to supernode
</li>
<li>if &lt; x matches found, supernode forward
</li>
<li>if &lt; x matches found, forward
</li>
<li>result: ContentHash and list of nodes holding file
</li>
</ol>
</div>
</li>
<li><a id="sec-6-3-4-2-4" name="sec-6-3-4-2-4"></a>Download<br  /><div class="outline-text-6" id="text-6-3-4-2-4">
<ul class="org-ul">
<li>if available in multiple nodes, parallel downloading
</li>
<li>automatic recovery
<ul class="org-ul">
<li>client peer switch to new server peer when unavailable
</li>
<li>ContentHash is used to search for new copy
</li>
</ul>
</li>
</ul>
</div>
</li></ol>
</li></ol>
</div>
</div>
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Structured DHT Systems</h3>
<div class="outline-text-3" id="text-6-4">
</div><div id="outline-container-sec-6-4-1" class="outline-4">
<h4 id="sec-6-4-1"><span class="section-number-4">6.4.1</span> Overview</h4>
<div class="outline-text-4" id="text-6-4-1">
<ul class="org-ul">
<li>tight coupling between nodes and file locations
</li>
<li>assign nodes to hold particular contents
</li>
<li>want to distribute responsibilities among nodes
</li>
<li>when a node requests that content, go to node that is supposed to have/know about it
</li>
<li>arrange neighbour relationship between nodes in a restrictive structure to facilitate query routing
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-4-2" class="outline-4">
<h4 id="sec-6-4-2"><span class="section-number-4">6.4.2</span> DHT Services</h4>
<div class="outline-text-4" id="text-6-4-2">
</div><ol class="org-ol"><li><a id="sec-6-4-2-1" name="sec-6-4-2-1"></a>The Hash<br  /><div class="outline-text-5" id="text-6-4-2-1">
<ul class="org-ul">
<li>hash function:
<ul class="org-ul">
<li>files &rarr; [0,k]
</li>
</ul>
</li>
<li>distribute [0,k] among all nodes
</li>
<li>node [l,r] is responsible for files that are mapped into l &le; x &le; r
<ul class="org-ul">
<li>direct
<ul class="org-ul">
<li>physically store files
</li>
</ul>
</li>
<li>indirect
<ul class="org-ul">
<li>stores locations of files
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-6-4-2-2" name="sec-6-4-2-2"></a>Routing<br  /><div class="outline-text-5" id="text-6-4-2-2">
<ul class="org-ul">
<li>query efficiently routed to node whose range covers file
</li>
<li>implemented in fully distributed manner
</li>
<li>each node maintains info of range spaces covered by some other nodes
</li>
<li>complexity must scale with system growth
</li>
<li>gracefully handle node joining/leaving system
<ul class="org-ul">
<li>bootstrap to connect
</li>
<li>repartition range on joining/leaving nodes
</li>
<li>reorganize/update routing info
</li>
</ul>
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-6-4-3" class="outline-4">
<h4 id="sec-6-4-3"><span class="section-number-4">6.4.3</span> Consistent Hashing</h4>
<div class="outline-text-4" id="text-6-4-3">
<ul class="org-ul">
<li>Range [0,2<sup>m</sup>-1]
</li>
<li>Let ..p n s .. be among the graph. Let f(i) be the assigned number to node i. Then node n is responsible for nodes [f(p)+1 mod 2<sup>m</sup>-1,f(n) mod 2<sup>m</sup>-1].
</li>
<li>Each file is held in a node with node<sub>id</sub> &ge; file<sub>id</sub>
</li>
</ul>
</div>
<ol class="org-ol"><li><a id="sec-6-4-3-1" name="sec-6-4-3-1"></a>Scheme 1<br  /><div class="outline-text-5" id="text-6-4-3-1">
<ul class="org-ul">
<li>each node maintains ID and IP of successor
</li>
<li>low complexity of routing info
</li>
<li>high complexity of query routing
</li>
</ul>
</div>
</li>
<li><a id="sec-6-4-3-2" name="sec-6-4-3-2"></a>Scheme 2<br  /><div class="outline-text-5" id="text-6-4-3-2">
<ul class="org-ul">
<li>each node maintains ID and IP of all nodes
</li>
<li>low complexity of query routing
</li>
<li>high complexity of routing info
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-6-4-4" class="outline-4">
<h4 id="sec-6-4-4"><span class="section-number-4">6.4.4</span> Chord</h4>
<div class="outline-text-4" id="text-6-4-4">
</div><ol class="org-ol"><li><a id="sec-6-4-4-1" name="sec-6-4-4-1"></a>Method<br  /><div class="outline-text-5" id="text-6-4-4-1">
<ul class="org-ul">
<li>each node maintains ID and IP of nodes in a finger table
</li>
<li><code>table[n][i]</code> = ID and IP of first node that succeeds n by at least 2<sup>(i-1)</sup> on ID circle
<ul class="org-ul">
<li>each entry called a finger
</li>
</ul>
</li>
<li>suppose want to query key k at node n, then lookup the table[n][log2(k-n)+1]
</li>
<li>O(lgN) routing information, O(lgN) query routing
</li>
<li>query can always be routed correctly as long as each node knows its correct successor node
</li>
</ul>
</div>
</li>
