CZ4013/summary.org
**** Node Join
- if each node maintains info about its predecessor node, the node join is similar to doubly-linked list node join
  1. n uses bootstrapping process to find node
  2. n asks node to locate n's successor by key n
  3. n sets successor node
  4. n's predecessor is successor's predecessor
  5. n's predecessor's successor is n
  6. n's successor's predecessor is n
  7. build up finger table by querying
  8. let p be predecessor, s be successor
     - foreach i in [1..m],
       - foreach node x in [p-2^(i-1)+1,n-2^(i-1)],
         - table[x][i] = n
     log^2(N) complexity of node insertion
  9. n reports files that it is willing to share to nodes responsible for them
**** Node Leave
Similar to node join
* Name Services
** Names and Name Services
*** Names and Addresses
- Resources need to identify each other
- Names identify resources in a location-independent fashion
- Addresses identify resources in a location-dependent fashion
*** Name Service
- name \rightarrow address
- DNS: domain names \leftrightarrow IP address
- Java RMIregistry: remote object name \leftrightarrow remote object ref
- Name resolution: name \rightarrow address
  - may involve >1 translation
    - domain \rightarrow IP address \rightarrow MAC (by ARP)
  - pathname by filesystem
- Generally
  - address is just one of many attributes of resources
  - names \leftrightarrow attributes
*** Main Requirements
- scalability
  - arbitrary number of names
  - arbitrary number of administrative organizations
- reliability
  - high availability
  - no failure
- performance
  - shouldn't introduce much delay
*** Namespace
- collection of all valid names
  - requires syntactic definition
- can have hierarchical structure
  - each part resolved relative to a separate context
  - same name diff meanings in diff contexts
  - e.g. UNIX filesystem
  - more scalability
- can have flat structure
- e.g. DNS
  - hierarchical
  - domain name: \geq1 strings separated by dot
*** Name Resolution Process
- name server maintain name \rightarrow address mappings
  - binding: name \rightarrow resource
  - unbound: name doesn't correspond resource
- physically, resolution may involve more than 1 nameserver
  - may not be available at every nameserver; hierarchical namespace
  - iterative client-controlled navigation
  - non-recursive server-controlled navigation
  - recursive server-controlled navigation
*** Iterative Client-Controlled Navigation
- iteratively contacts a group of NS to resolve name
  - NS1,..,NS_i,NS_i+1,..
  - Potentially high communication cost if far away
- variation: multicast navigation
  - client multicasts name to group of NS
  - server holding name mapping responds
  - possibly faster response
  - possibly more network traffic
*** Nonrecursive Server-Controlled Navigation
- nameserver coordinates name resolution process on behalf of a client then passes back to client
- communicates by multicast/iteratively like a client
*** Recursive Server-Controlled Navigation
- recursively find until found
- caching results is more effective
- higher performance demand on each nameserver
  - may tie up server threads
  - may delay other requests
** Domain Name System
*** Overview
**** Scalability
- hierarchical namespace
- namespace is partitioned and managed by large group of nameservers
**** Reliability
- uses replication
**** Performance
- uses caching
*** Hierarchical Name Space
- DNS manage names of computers and domains
- domains associated with organizations
  - tree-like hierarchical structure refecting structure of organizations
- each domain manages own names
  - NTU gets name from whoever is in charge of edu.sg
  - Afterwards, it is free to assign hostnames within NTU w/o going back to edu.sg administration
*** Name Space Partitioning
- in original internet naming system, all hostnames and addresses were held in a single central master file downloaded by FTP to all computers
  - did not scale well
  - replaced by DNS
- DNS is decentralized
  - no single server is responsible for all names
  - entire name space is partitioned among largs group of name servers
  - each server holds authoritative mappings for names in one or more domains

*** DNS Name Servers
- information held
  - name \rightarrow IP addr for local domain
  - name & address of all name servers in local domain
  - name & address of name servers in its subdomains
  - name & address of root name servers
- each mapping contains: name+time-to-live+class+type+value
- allows multiple names to be mapped into same IP address
*** DNS Queries
**** Host name resolution
To resolve host names into IP addresses
**** Mail host location
To resolve domain names into IP addresses of mail hosts
*** Replication for Reliability
Authoritative mappings of each domain must be held by \geq2 name servers.
1. Primary server
   Reads mappings directly from local master file.
2. Secondary servers
   - Download mappings from primary server.
   - Periodically checks w/ primary server to see whether stored mappings are up-to-date

Root domain has about 12 secondary servers to share heavy workload.
