CZ4013/summary.html
<li><a id="sec-6-4-4-2" name="sec-6-4-4-2"></a>Node Join<br  /><div class="outline-text-5" id="text-6-4-4-2">
<ul class="org-ul">
<li>if each node maintains info about its predecessor node, the node join is similar to doubly-linked list node join
<ol class="org-ol">
<li>n uses bootstrapping process to find node
</li>
<li>n asks node to locate n's successor by key n
</li>
<li>n sets successor node
</li>
<li>n's predecessor is successor's predecessor
</li>
<li>n's predecessor's successor is n
</li>
<li>n's successor's predecessor is n
</li>
<li>build up finger table by querying
</li>
<li>let p be predecessor, s be successor
<ul class="org-ul">
<li>foreach i in [1..m],
<ul class="org-ul">
<li>foreach node x in [p-2<sup>(i-1)</sup>+1,n-2<sup>(i-1)</sup>],
<ul class="org-ul">
<li>table[x][i] = n
</li>
</ul>
</li>
</ul>
</li>
</ul>
<p>
log<sup>2</sup>(N) complexity of node insertion
</p>
</li>
<li>n reports files that it is willing to share to nodes responsible for them
</li>
</ol>
</li>
</ul>
</div>
</li>
<li><a id="sec-6-4-4-3" name="sec-6-4-4-3"></a>Node Leave<br  /><div class="outline-text-5" id="text-6-4-4-3">
<p>
Similar to node join
</p>
</div>
</li></ol>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Name Services</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Names and Name Services</h3>
<div class="outline-text-3" id="text-7-1">
</div><div id="outline-container-sec-7-1-1" class="outline-4">
<h4 id="sec-7-1-1"><span class="section-number-4">7.1.1</span> Names and Addresses</h4>
<div class="outline-text-4" id="text-7-1-1">
<ul class="org-ul">
<li>Resources need to identify each other
</li>
<li>Names identify resources in a location-independent fashion
</li>
<li>Addresses identify resources in a location-dependent fashion
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-1-2" class="outline-4">
<h4 id="sec-7-1-2"><span class="section-number-4">7.1.2</span> Name Service</h4>
<div class="outline-text-4" id="text-7-1-2">
<ul class="org-ul">
<li>name &rarr; address
</li>
<li>DNS: domain names &harr; IP address
</li>
<li>Java RMIregistry: remote object name &harr; remote object ref
</li>
<li>Name resolution: name &rarr; address
<ul class="org-ul">
<li>may involve &gt;1 translation
<ul class="org-ul">
<li>domain &rarr; IP address &rarr; MAC (by ARP)
</li>
</ul>
</li>
<li>pathname by filesystem
</li>
</ul>
</li>
<li>Generally
<ul class="org-ul">
<li>address is just one of many attributes of resources
</li>
<li>names &harr; attributes
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-1-3" class="outline-4">
<h4 id="sec-7-1-3"><span class="section-number-4">7.1.3</span> Main Requirements</h4>
<div class="outline-text-4" id="text-7-1-3">
<ul class="org-ul">
<li>scalability
<ul class="org-ul">
<li>arbitrary number of names
</li>
<li>arbitrary number of administrative organizations
</li>
</ul>
</li>
<li>reliability
<ul class="org-ul">
<li>high availability
</li>
<li>no failure
</li>
</ul>
</li>
<li>performance
<ul class="org-ul">
<li>shouldn't introduce much delay
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-1-4" class="outline-4">
<h4 id="sec-7-1-4"><span class="section-number-4">7.1.4</span> Namespace</h4>
<div class="outline-text-4" id="text-7-1-4">
<ul class="org-ul">
<li>collection of all valid names
<ul class="org-ul">
<li>requires syntactic definition
</li>
</ul>
</li>
<li>can have hierarchical structure
<ul class="org-ul">
<li>each part resolved relative to a separate context
</li>
<li>same name diff meanings in diff contexts
</li>
<li>e.g. UNIX filesystem
</li>
<li>more scalability
</li>
</ul>
</li>
<li>can have flat structure
</li>
<li>e.g. DNS
<ul class="org-ul">
<li>hierarchical
</li>
<li>domain name: &ge;1 strings separated by dot
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-1-5" class="outline-4">
<h4 id="sec-7-1-5"><span class="section-number-4">7.1.5</span> Name Resolution Process</h4>
<div class="outline-text-4" id="text-7-1-5">
<ul class="org-ul">
<li>name server maintain name &rarr; address mappings
<ul class="org-ul">
<li>binding: name &rarr; resource
</li>
<li>unbound: name doesn't correspond resource
</li>
</ul>
</li>
<li>physically, resolution may involve more than 1 nameserver
<ul class="org-ul">
<li>may not be available at every nameserver; hierarchical namespace
</li>
<li>iterative client-controlled navigation
</li>
<li>non-recursive server-controlled navigation
</li>
<li>recursive server-controlled navigation
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-1-6" class="outline-4">
<h4 id="sec-7-1-6"><span class="section-number-4">7.1.6</span> Iterative Client-Controlled Navigation</h4>
<div class="outline-text-4" id="text-7-1-6">
<ul class="org-ul">
<li>iteratively contacts a group of NS to resolve name
<ul class="org-ul">
<li>NS1,..,NS<sub>i</sub>,NS<sub>i</sub>+1,..
</li>
<li>Potentially high communication cost if far away
</li>
</ul>
</li>
<li>variation: multicast navigation
<ul class="org-ul">
<li>client multicasts name to group of NS
</li>
<li>server holding name mapping responds
</li>
<li>possibly faster response
</li>
<li>possibly more network traffic
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-1-7" class="outline-4">
<h4 id="sec-7-1-7"><span class="section-number-4">7.1.7</span> Nonrecursive Server-Controlled Navigation</h4>
<div class="outline-text-4" id="text-7-1-7">
<ul class="org-ul">
<li>nameserver coordinates name resolution process on behalf of a client then passes back to client
</li>
<li>communicates by multicast/iteratively like a client
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-1-8" class="outline-4">
<h4 id="sec-7-1-8"><span class="section-number-4">7.1.8</span> Recursive Server-Controlled Navigation</h4>
<div class="outline-text-4" id="text-7-1-8">
<ul class="org-ul">
<li>recursively find until found
</li>
<li>caching results is more effective
</li>
<li>higher performance demand on each nameserver
<ul class="org-ul">
<li>may tie up server threads
</li>
<li>may delay other requests
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Domain Name System</h3>
<div class="outline-text-3" id="text-7-2">
</div><div id="outline-container-sec-7-2-1" class="outline-4">
<h4 id="sec-7-2-1"><span class="section-number-4">7.2.1</span> Overview</h4>
<div class="outline-text-4" id="text-7-2-1">
</div><ol class="org-ol"><li><a id="sec-7-2-1-1" name="sec-7-2-1-1"></a>Scalability<br  /><div class="outline-text-5" id="text-7-2-1-1">
<ul class="org-ul">
<li>hierarchical namespace
</li>
<li>namespace is partitioned and managed by large group of nameservers
</li>
</ul>
</div>
</li>
<li><a id="sec-7-2-1-2" name="sec-7-2-1-2"></a>Reliability<br  /><div class="outline-text-5" id="text-7-2-1-2">
<ul class="org-ul">
<li>uses replication
</li>
</ul>
</div>
</li>
<li><a id="sec-7-2-1-3" name="sec-7-2-1-3"></a>Performance<br  /><div class="outline-text-5" id="text-7-2-1-3">
<ul class="org-ul">
<li>uses caching
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-7-2-2" class="outline-4">
<h4 id="sec-7-2-2"><span class="section-number-4">7.2.2</span> Hierarchical Name Space</h4>
<div class="outline-text-4" id="text-7-2-2">
<ul class="org-ul">
<li>DNS manage names of computers and domains
</li>
<li>domains associated with organizations
<ul class="org-ul">
<li>tree-like hierarchical structure refecting structure of organizations
</li>
</ul>
</li>
<li>each domain manages own names
<ul class="org-ul">
<li>NTU gets name from whoever is in charge of edu.sg
</li>
<li>Afterwards, it is free to assign hostnames within NTU w/o going back to edu.sg administration
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-2-3" class="outline-4">
<h4 id="sec-7-2-3"><span class="section-number-4">7.2.3</span> Name Space Partitioning</h4>
<div class="outline-text-4" id="text-7-2-3">
<ul class="org-ul">
<li>in original internet naming system, all hostnames and addresses were held in a single central master file downloaded by FTP to all computers
<ul class="org-ul">
<li>did not scale well
</li>
<li>replaced by DNS
</li>
</ul>
</li>
<li>DNS is decentralized
<ul class="org-ul">
<li>no single server is responsible for all names
</li>
<li>entire name space is partitioned among largs group of name servers
</li>
<li>each server holds authoritative mappings for names in one or more domains
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7-2-4" class="outline-4">
<h4 id="sec-7-2-4"><span class="section-number-4">7.2.4</span> DNS Name Servers</h4>
<div class="outline-text-4" id="text-7-2-4">
<ul class="org-ul">
<li>information held
<ul class="org-ul">
<li>name &rarr; IP addr for local domain
</li>
<li>name &amp; address of all name servers in local domain
</li>
<li>name &amp; address of name servers in its subdomains
</li>
<li>name &amp; address of root name servers
</li>
</ul>
</li>
<li>each mapping contains: name+time-to-live+class+type+value
</li>
<li>allows multiple names to be mapped into same IP address
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-2-5" class="outline-4">
<h4 id="sec-7-2-5"><span class="section-number-4">7.2.5</span> DNS Queries</h4>
<div class="outline-text-4" id="text-7-2-5">
</div><ol class="org-ol"><li><a id="sec-7-2-5-1" name="sec-7-2-5-1"></a>Host name resolution<br  /><div class="outline-text-5" id="text-7-2-5-1">
<p>
To resolve host names into IP addresses
</p>
</div>
</li>
<li><a id="sec-7-2-5-2" name="sec-7-2-5-2"></a>Mail host location<br  /><div class="outline-text-5" id="text-7-2-5-2">
<p>
To resolve domain names into IP addresses of mail hosts
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-7-2-6" class="outline-4">
<h4 id="sec-7-2-6"><span class="section-number-4">7.2.6</span> Replication for Reliability</h4>
<div class="outline-text-4" id="text-7-2-6">
<p>
Authoritative mappings of each domain must be held by &ge;2 name servers.
</p>
<ol class="org-ol">
<li>Primary server
Reads mappings directly from local master file.
</li>
<li>Secondary servers
<ul class="org-ul">
<li>Download mappings from primary server.
</li>
<li>Periodically checks w/ primary server to see whether stored mappings are up-to-date
</li>
</ul>
</li>
</ol>

<p>
Root domain has about 12 secondary servers to share heavy workload.
</p>
</div>
</div>
