CZ4013/summary.org
*** DNS Name Resolution Process
- uses simple request-reply protocol over UDP
  - name server implements BIND
  - name servers use well known port number
  - DNS client is called resolver
- primarily uses combination of iterative client-controlled navigation and non-recursive server-controlled navigation
  - client contacts first server it knows of & progresses if unavailable
  - non-recursive server-controlled navigation is then used
*** Caching
- uses caching to improve performance
  - @ client
  - @ name server
- always consult caches before sending queries to other servers
- advantages
  - reduce response time
  - save network traffic
  - alleviate workload of high-level name servers
- introduces consistency problem
  - query answers returned from mappings are called non-authoritative answers
  - mappings and hence non-authoritative answers may be out-of-date
- timeout to address consistency problem
  - time-to-live values for cache expiry time
  - stale answers may still be provided before timeout
  - longer time-to-live \rightarrow weaker consistency
* Time and Global States
** Synchronizing Physical Clocks
*** Computer Clocks
- computers have their own physical clocks that deviate from one another
- *offset*: instantaneous difference between readings of two clocks
- *reference clock e.g. UTC*: ignals are broadcasted regularly from land-based radio stations and statellites around world
- *clock drift*: clocks count time at different rates
- *drift rate*: change in offset between a clock and a perfect reference clock per unit of time measured by reference clock
*** Cristian's Method
Suppose A wants to sync with B.
- A requests
- B replies T_B
- A records T_{round} = t_2 - t_1
- A sets clock to T_B + T_{round}/2

When A receives reply, time reading in B \in [T_B,T_B+T_{round}]. Taking the middle, A sets clock to T_B + T_{round}/2, so accuracy is +/- T_{round}/2.

To handle variability, make serveral requests to B and take min{T_{round}} for most accurate estimate.
*** Berkeley Algorithm
**** Definitions
***** Master
Coordinator computer
***** Slaves
Other computers whose clocks are to be sync'ed.
**** How it works
1. Master periodically polls slaves
2. Slaves reply with clocks
3. Master evaluates local times of slaves by T_{round}
4. Master averages values obtained
5. Master sends amount of adjustment to each slave

If master fails, elect another computer.
*** NTP
**** Comparison
- over internet, while former two are over intranets
- decentralized, while former two are centralized
**** Architecture
- a network of servers are structured hierarchically into synchronization subnet
  - primary servers (stratum 1) connected directly to time source
  - statum i are sync'ed with stratum i-1, \forall i \geq 2
  - Lowest level servers execute in users' workstations
**** Fault-tolerance
- servers can reconfigure themselves
  - if primary server UTC source fails, make it to be stratum 2 server.
  - if stratum 2 server's source of sync fails, sync with another primary server.
**** Message Exchange
- contains:
  - local times when previous NTP message between pair was sent&received.
  - local time when current NTP message was sent.
- Example
  - Suppose m is sent from A to B at T_{i-3} and arrives at T_{i-2}.
    Suppose m' is sent from B to A at T_{i-1} and arrives at T_{i}.
  - Total transmission time is (T_{i}-T_{i-3}) - (T_{i-1}-T_{i-2}).
    Transmission time of m' \in [0,(T_{i}-T_{i-3}) - (T_{i-1}-T_{i-2})].
    If it is 0, when A receives m', B's clock is T_{i-1}.
    If it is (T_{i}-T_{i-3}) - (T_{i-1}-T_{i-2}), when A receives m', B's clock is T_{i-1} + (T_{i}-T_{i-3}) - (T_{i-1}-T_{i-2}) = T_{i}-T_{i-3}+T_{i-2}
    In any case, when A receives m', B's clock reading \in [T_{i-1}, T_{i}-T_{i-3}+T_{i-2}]. Taking the middle point, A should set clock to 1/2 (T_{i-1} + T_{i}-T_{i-3}+T_{i-2}). Accuracy is +/- 1/2 (T_{i-1} - (T_{i}-T_{i-3}+T_{i-2})).
**** Misc
- applies data filtering to improve accuracy of synchronization over time
  - retain estimates of 8 most recent message exchanges and their accuracies
  - choose one with highest accuracy
- to choose peer, NTP server engages in message exchanges with several peers and applies peer-selection algo.
** Causal Ordering and Logical Clocks
*** System model
**** Distributed system
- N processes p_1,..,p_N
- each process on single processor
- no shared memory
- only way to communicate is through message passing through network
- reliable communication channels
- *asynchronous system*: no bounds on execution speed, transmission delays, clock drift rates
**** Process state
- values of all variables within the process
- values of any objects in local OS environment that process affects
- let s_i be state of process p_i
**** Process execution
- process takes a series of actions, either:
  - send message
  - receive message
  - internal action that transforms state
- *event*: occurence of a single action
*** Causal Ordering
- in asynchronous system, events can be ordered based on cause-and-effect
  - events within p_i can be placed in a unique total ordering
    - sequence of events within single process p_i is well defined
  - whenever message is sent between processes, event of sending message occurs before event of receiving message 
- denoted by \rightarrow
- is a *partial ordering*: there may exist pairs of events that remain unordered
- if !(e \rightarrow e') and !(e' \rightarrow e), then e || e'.
