CZ4013/summary.html
<div id="outline-container-sec-7-2-7" class="outline-4">
<h4 id="sec-7-2-7"><span class="section-number-4">7.2.7</span> DNS Name Resolution Process</h4>
<div class="outline-text-4" id="text-7-2-7">
<ul class="org-ul">
<li>uses simple request-reply protocol over UDP
<ul class="org-ul">
<li>name server implements BIND
</li>
<li>name servers use well known port number
</li>
<li>DNS client is called resolver
</li>
</ul>
</li>
<li>primarily uses combination of iterative client-controlled navigation and non-recursive server-controlled navigation
<ul class="org-ul">
<li>client contacts first server it knows of &amp; progresses if unavailable
</li>
<li>non-recursive server-controlled navigation is then used
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-2-8" class="outline-4">
<h4 id="sec-7-2-8"><span class="section-number-4">7.2.8</span> Caching</h4>
<div class="outline-text-4" id="text-7-2-8">
<ul class="org-ul">
<li>uses caching to improve performance
<ul class="org-ul">
<li>@ client
</li>
<li>@ name server
</li>
</ul>
</li>
<li>always consult caches before sending queries to other servers
</li>
<li>advantages
<ul class="org-ul">
<li>reduce response time
</li>
<li>save network traffic
</li>
<li>alleviate workload of high-level name servers
</li>
</ul>
</li>
<li>introduces consistency problem
<ul class="org-ul">
<li>query answers returned from mappings are called non-authoritative answers
</li>
<li>mappings and hence non-authoritative answers may be out-of-date
</li>
</ul>
</li>
<li>timeout to address consistency problem
<ul class="org-ul">
<li>time-to-live values for cache expiry time
</li>
<li>stale answers may still be provided before timeout
</li>
<li>longer time-to-live &rarr; weaker consistency
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Time and Global States</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Synchronizing Physical Clocks</h3>
<div class="outline-text-3" id="text-8-1">
</div><div id="outline-container-sec-8-1-1" class="outline-4">
<h4 id="sec-8-1-1"><span class="section-number-4">8.1.1</span> Computer Clocks</h4>
<div class="outline-text-4" id="text-8-1-1">
<ul class="org-ul">
<li>computers have their own physical clocks that deviate from one another
</li>
<li><b>offset</b>: instantaneous difference between readings of two clocks
</li>
<li><b>reference clock e.g. UTC</b>: ignals are broadcasted regularly from land-based radio stations and statellites around world
</li>
<li><b>clock drift</b>: clocks count time at different rates
</li>
<li><b>drift rate</b>: change in offset between a clock and a perfect reference clock per unit of time measured by reference clock
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-1-2" class="outline-4">
<h4 id="sec-8-1-2"><span class="section-number-4">8.1.2</span> Cristian's Method</h4>
<div class="outline-text-4" id="text-8-1-2">
<p>
Suppose A wants to sync with B.
</p>
<ul class="org-ul">
<li>A requests
</li>
<li>B replies T<sub>B</sub>
</li>
<li>A records T<sub>round</sub> = t<sub>2</sub> - t<sub>1</sub>
</li>
<li>A sets clock to T<sub>B</sub> + T<sub>round</sub>/2
</li>
</ul>

<p>
When A receives reply, time reading in B &isin; [T<sub>B</sub>,T<sub>B</sub>+T<sub>round</sub>]. Taking the middle, A sets clock to T<sub>B</sub> + T<sub>round</sub>/2, so accuracy is +/- T<sub>round</sub>/2.
</p>

<p>
To handle variability, make serveral requests to B and take min{T<sub>round</sub>} for most accurate estimate.
</p>
</div>
</div>
<div id="outline-container-sec-8-1-3" class="outline-4">
<h4 id="sec-8-1-3"><span class="section-number-4">8.1.3</span> Berkeley Algorithm</h4>
<div class="outline-text-4" id="text-8-1-3">
</div><ol class="org-ol"><li><a id="sec-8-1-3-1" name="sec-8-1-3-1"></a>Definitions<br  /><ol class="org-ol"><li><a id="sec-8-1-3-1-1" name="sec-8-1-3-1-1"></a>Master<br  /><div class="outline-text-6" id="text-8-1-3-1-1">
<p>
Coordinator computer
</p>
</div>
</li>
<li><a id="sec-8-1-3-1-2" name="sec-8-1-3-1-2"></a>Slaves<br  /><div class="outline-text-6" id="text-8-1-3-1-2">
<p>
Other computers whose clocks are to be sync'ed.
</p>
</div>
</li></ol>
</li>
<li><a id="sec-8-1-3-2" name="sec-8-1-3-2"></a>How it works<br  /><div class="outline-text-5" id="text-8-1-3-2">
<ol class="org-ol">
<li>Master periodically polls slaves
</li>
<li>Slaves reply with clocks
</li>
<li>Master evaluates local times of slaves by T<sub>round</sub>
</li>
<li>Master averages values obtained
</li>
<li>Master sends amount of adjustment to each slave
</li>
</ol>

<p>
If master fails, elect another computer.
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-8-1-4" class="outline-4">
<h4 id="sec-8-1-4"><span class="section-number-4">8.1.4</span> NTP</h4>
<div class="outline-text-4" id="text-8-1-4">
</div><ol class="org-ol"><li><a id="sec-8-1-4-1" name="sec-8-1-4-1"></a>Comparison<br  /><div class="outline-text-5" id="text-8-1-4-1">
<ul class="org-ul">
<li>over internet, while former two are over intranets
</li>
<li>decentralized, while former two are centralized
</li>
</ul>
</div>
</li>
<li><a id="sec-8-1-4-2" name="sec-8-1-4-2"></a>Architecture<br  /><div class="outline-text-5" id="text-8-1-4-2">
<ul class="org-ul">
<li>a network of servers are structured hierarchically into synchronization subnet
<ul class="org-ul">
<li>primary servers (stratum 1) connected directly to time source
</li>
<li>statum i are sync'ed with stratum i-1, &forall; i &ge; 2
</li>
<li>Lowest level servers execute in users' workstations
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-8-1-4-3" name="sec-8-1-4-3"></a>Fault-tolerance<br  /><div class="outline-text-5" id="text-8-1-4-3">
<ul class="org-ul">
<li>servers can reconfigure themselves
<ul class="org-ul">
<li>if primary server UTC source fails, make it to be stratum 2 server.
</li>
<li>if stratum 2 server's source of sync fails, sync with another primary server.
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-8-1-4-4" name="sec-8-1-4-4"></a>Message Exchange<br  /><div class="outline-text-5" id="text-8-1-4-4">
<ul class="org-ul">
<li>contains:
<ul class="org-ul">
<li>local times when previous NTP message between pair was sent&amp;received.
</li>
<li>local time when current NTP message was sent.
</li>
</ul>
</li>
<li>Example
<ul class="org-ul">
<li>Suppose m is sent from A to B at T<sub>i-3</sub> and arrives at T<sub>i-2</sub>.
Suppose m' is sent from B to A at T<sub>i-1</sub> and arrives at T<sub>i</sub>.
</li>
<li>Total transmission time is (T<sub>i</sub>-T<sub>i-3</sub>) - (T<sub>i-1</sub>-T<sub>i-2</sub>).
Transmission time of m' &isin; [0,(T<sub>i</sub>-T<sub>i-3</sub>) - (T<sub>i-1</sub>-T<sub>i-2</sub>)].
If it is 0, when A receives m', B's clock is T<sub>i-1</sub>.
If it is (T<sub>i</sub>-T<sub>i-3</sub>) - (T<sub>i-1</sub>-T<sub>i-2</sub>), when A receives m', B's clock is T<sub>i-1</sub> + (T<sub>i</sub>-T<sub>i-3</sub>) - (T<sub>i-1</sub>-T<sub>i-2</sub>) = T<sub>i</sub>-T<sub>i-3</sub>+T<sub>i-2</sub>
In any case, when A receives m', B's clock reading &isin; [T<sub>i-1</sub>, T<sub>i</sub>-T<sub>i-3</sub>+T<sub>i-2</sub>]. Taking the middle point, A should set clock to 1/2 (T<sub>i-1</sub> + T<sub>i</sub>-T<sub>i-3</sub>+T<sub>i-2</sub>). Accuracy is +/- 1/2 (T<sub>i-1</sub> - (T<sub>i</sub>-T<sub>i-3</sub>+T<sub>i-2</sub>)).
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-8-1-4-5" name="sec-8-1-4-5"></a>Misc<br  /><div class="outline-text-5" id="text-8-1-4-5">
<ul class="org-ul">
<li>applies data filtering to improve accuracy of synchronization over time
<ul class="org-ul">
<li>retain estimates of 8 most recent message exchanges and their accuracies
</li>
<li>choose one with highest accuracy
</li>
</ul>
</li>
<li>to choose peer, NTP server engages in message exchanges with several peers and applies peer-selection algo.
</li>
</ul>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> Causal Ordering and Logical Clocks</h3>
<div class="outline-text-3" id="text-8-2">
</div><div id="outline-container-sec-8-2-1" class="outline-4">
<h4 id="sec-8-2-1"><span class="section-number-4">8.2.1</span> System model</h4>
<div class="outline-text-4" id="text-8-2-1">
</div><ol class="org-ol"><li><a id="sec-8-2-1-1" name="sec-8-2-1-1"></a>Distributed system<br  /><div class="outline-text-5" id="text-8-2-1-1">
<ul class="org-ul">
<li>N processes p<sub>1</sub>,..,p<sub>N</sub>
</li>
<li>each process on single processor
</li>
<li>no shared memory
</li>
<li>only way to communicate is through message passing through network
</li>
<li>reliable communication channels
</li>
<li><b>asynchronous system</b>: no bounds on execution speed, transmission delays, clock drift rates
</li>
</ul>
</div>
</li>
<li><a id="sec-8-2-1-2" name="sec-8-2-1-2"></a>Process state<br  /><div class="outline-text-5" id="text-8-2-1-2">
<ul class="org-ul">
<li>values of all variables within the process
</li>
<li>values of any objects in local OS environment that process affects
</li>
<li>let s<sub>i</sub> be state of process p<sub>i</sub>
</li>
</ul>
</div>
</li>
<li><a id="sec-8-2-1-3" name="sec-8-2-1-3"></a>Process execution<br  /><div class="outline-text-5" id="text-8-2-1-3">
<ul class="org-ul">
<li>process takes a series of actions, either:
<ul class="org-ul">
<li>send message
</li>
<li>receive message
</li>
<li>internal action that transforms state
</li>
</ul>
</li>
<li><b>event</b>: occurence of a single action
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-8-2-2" class="outline-4">
<h4 id="sec-8-2-2"><span class="section-number-4">8.2.2</span> Causal Ordering</h4>
<div class="outline-text-4" id="text-8-2-2">
<ul class="org-ul">
<li>in asynchronous system, events can be ordered based on cause-and-effect
<ul class="org-ul">
<li>events within p<sub>i</sub> can be placed in a unique total ordering
<ul class="org-ul">
<li>sequence of events within single process p<sub>i</sub> is well defined
</li>
</ul>
</li>
<li>whenever message is sent between processes, event of sending message occurs before event of receiving message 
</li>
</ul>
</li>
<li>denoted by &rarr;
</li>
<li>is a <b>partial ordering</b>: there may exist pairs of events that remain unordered
</li>
<li>if !(e &rarr; e') and !(e' &rarr; e), then e || e'.
</li>
</ul>
</div>
</div>
