CZ4013/summary.org
*** Lamport's Logical Clocks
**** Description
- *logical clock*: a monotonically increasing SW counter whose value bears no relationship with time
- p_i keeps logical clock L_i to timestamp events
**** How it works
1. \forall i, L_i = 0
2. Foreach event, increments L_i++ before timestamping it
3. When p_i sends m, t=L_i is piggybacked
4. When p_j receives (m,t), set L_j = max(L_j,t) before incrementing to timestamp
**** Theorem
e \rightarrow e' \Rightarrow L(e) < L(e')
*** Vector Clocks
**** Description
- V_i[1..N] = vector clock of process i
- Sets V_i[i]++ before timestamping each event at p_i
- When p_i sends m, t=V_i is piggybacked
- When p_j receives (m,t), set V_j[k] = max(V_j[k],t[k]) \forall k \in [1,N] before incrementing V_j[j] to timestamp
**** Rules
- V = V' \Leftrightarrow V[k] = V'[k] \forall k
- V \leq V' \Leftrightarrow V[k] \leq V'[k] \forall k
- V < V' \Leftrightarrow V \leq V' and V \neq V'
**** Theorem
- e \rightarrow e' \Leftrightarrow V(e) < V(e')
- Incomparable timestamps when concurrent:
  - e || e' \Leftrightarrow !(V(e) \leq V(e')) and !(V(e') \leq V(e))
** Global States
*** Motivation
Need to find out whether a property is true when DS executes
e.g. distributed deadlock detection
- each collection of processes waits for another
- cycle in grah of "wait-for" relationship
*** System Model
- *history of p_i*: all events within p_i and ordered by their occurences
  - h_i = <e_i^1,e_i^2,..>
- *prefix of history of p_i*: first k events in h_i
  - h_i^k = <e_i^1,e_i^2,..,e_i^k>
- *cut*: union of prefixes of histories
  - C = h_1^{c_1} \cup h_2^{c_2} \cup .. \cup h_N^{c_N}
- *global state*: set of states of all processes
  - let s_i^k be state of p_i after k^{th} event occurence
  - note that each global state <s_1^{c_1},s_2^{c_2},..,s_N^{c_N}> corresponds to a cut
*** Consistent Cut
- interested in cuts that are consistent
- *cut C is consistent*: \forall event e \in C, f \rightarrow e \Rightarrow f \in C
- otherwise, not consistent
- the corresponding global state of consistent cut is called a consistent global state
- in reality, system passes through consistent global states only
- gurantees 0 deadlock
*** Recording Snapshot
- steps
  1. p_1 records its local state
  2. p_1 sends m to p_2
  3. p_2 records its local state ASAP upon receival
- need to include state of communication channel
*** Chandy & Lamport Algorithm
**** Theorem
Chandy & Lamport Algorithm always selects a consistent cut
** Distributed Debugging
*** Description
- to establish what occurred during execution of DS
- to check whether they are correct
- but there is no global time!
- can use Chandy and Lamport to repeatedly record snapshots?
- *approach*: enumerate all consistent global states and check exhaustively
*** Lattice of Consistent Global States
- starting from initial state, advance one at a time
- each path from root to leaf represents an ordering of events that is consistent with causal ordering
- among possible paths, we can't tell which one actually executed since no global time
*** Observing Consistent Global States
- use additional monitor outside system to observe
- all processes in system send states to monitor
  - p_i sends its initial state to the monitor process initially
  - @e_i^{c_i}, p_i sends state to the monitor
- monitor assembles consistent global states
*** Global State Consistency Theorem
- *global state*: <s_1^{c_1},s_2^{c_2},..,s_N^{c_N}>
- V(e_i^{c_i}): vector clock timestamp of e_i^{c_i}
- <s_1^{c_1},s_2^{c_2},..,s_N^{c_N}> is consistent \Leftrightarrow \forall i,j, V(e_i^{c_i})[i] \geq V(e_j^{c_j})[i]
*** Debugging
How to check if constraint is broken?
1. construct lattice
2. foreach consistent global state, evaluate whether constraint satisfied
   - if all states satisfy, constraint can't be broken
   - if \exists state not satisfying, possible to be broken
   - if every path passes through \geq1 state not satisfying constraint, must be broken
* Coordination and Agreement
** Introduction
Shared values in DS is a problem.
- *mutual exclusion*: to coordinate access to shared resources
- *election*: to agree on a coordinator
- *consensus*: to agree on some value
** Distributed Mutex
*** Overview
Objective:
- prevents interference when a set of processes access shared resources
- extends critical section problem in OS

Distributed mutex:
- unlike standalone systems, in DS, neither shared variables nor facilities supplied by single local kernel can solve problem
- solution solely on *message passing*
*** System Model
- N processes p_1,..,p_N that don't share variables
- enter critical section to access shared resources
  - application-level protocol for CS
    - enter()
    - resourceAccess()
    - exit()
- asynchronous sytem
