CZ4013/summary.html
<div id="outline-container-sec-8-2-3" class="outline-4">
<h4 id="sec-8-2-3"><span class="section-number-4">8.2.3</span> Lamport's Logical Clocks</h4>
<div class="outline-text-4" id="text-8-2-3">
</div><ol class="org-ol"><li><a id="sec-8-2-3-1" name="sec-8-2-3-1"></a>Description<br  /><div class="outline-text-5" id="text-8-2-3-1">
<ul class="org-ul">
<li><b>logical clock</b>: a monotonically increasing SW counter whose value bears no relationship with time
</li>
<li>p<sub>i</sub> keeps logical clock L<sub>i</sub> to timestamp events
</li>
</ul>
</div>
</li>
<li><a id="sec-8-2-3-2" name="sec-8-2-3-2"></a>How it works<br  /><div class="outline-text-5" id="text-8-2-3-2">
<ol class="org-ol">
<li>&forall; i, L<sub>i</sub> = 0
</li>
<li>Foreach event, increments L<sub>i</sub>++ before timestamping it
</li>
<li>When p<sub>i</sub> sends m, t=L<sub>i</sub> is piggybacked
</li>
<li>When p<sub>j</sub> receives (m,t), set L<sub>j</sub> = max(L<sub>j</sub>,t) before incrementing to timestamp
</li>
</ol>
</div>
</li>
<li><a id="sec-8-2-3-3" name="sec-8-2-3-3"></a>Theorem<br  /><div class="outline-text-5" id="text-8-2-3-3">
<p>
e &rarr; e' &rArr; L(e) &lt; L(e')
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-8-2-4" class="outline-4">
<h4 id="sec-8-2-4"><span class="section-number-4">8.2.4</span> Vector Clocks</h4>
<div class="outline-text-4" id="text-8-2-4">
</div><ol class="org-ol"><li><a id="sec-8-2-4-1" name="sec-8-2-4-1"></a>Description<br  /><div class="outline-text-5" id="text-8-2-4-1">
<ul class="org-ul">
<li>V<sub>i[1</sub>..N] = vector clock of process i
</li>
<li>Sets V<sub>i[i]</sub>++ before timestamping each event at p<sub>i</sub>
</li>
<li>When p<sub>i</sub> sends m, t=V<sub>i</sub> is piggybacked
</li>
<li>When p<sub>j</sub> receives (m,t), set V<sub>j[k]</sub> = max(V<sub>j[k]</sub>,t[k]) &forall; k &isin; [1,N] before incrementing V<sub>j[j]</sub> to timestamp
</li>
</ul>
</div>
</li>
<li><a id="sec-8-2-4-2" name="sec-8-2-4-2"></a>Rules<br  /><div class="outline-text-5" id="text-8-2-4-2">
<ul class="org-ul">
<li>V = V' &hArr; V[k] = V'[k] &forall; k
</li>
<li>V &le; V' &hArr; V[k] &le; V'[k] &forall; k
</li>
<li>V &lt; V' &hArr; V &le; V' and V &ne; V'
</li>
</ul>
</div>
</li>
<li><a id="sec-8-2-4-3" name="sec-8-2-4-3"></a>Theorem<br  /><div class="outline-text-5" id="text-8-2-4-3">
<ul class="org-ul">
<li>e &rarr; e' &hArr; V(e) &lt; V(e')
</li>
<li>Incomparable timestamps when concurrent:
<ul class="org-ul">
<li>e || e' &hArr; !(V(e) &le; V(e')) and !(V(e') &le; V(e))
</li>
</ul>
</li>
</ul>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> Global States</h3>
<div class="outline-text-3" id="text-8-3">
</div><div id="outline-container-sec-8-3-1" class="outline-4">
<h4 id="sec-8-3-1"><span class="section-number-4">8.3.1</span> Motivation</h4>
<div class="outline-text-4" id="text-8-3-1">
<p>
Need to find out whether a property is true when DS executes
e.g. distributed deadlock detection
</p>
<ul class="org-ul">
<li>each collection of processes waits for another
</li>
<li>cycle in grah of "wait-for" relationship
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-3-2" class="outline-4">
<h4 id="sec-8-3-2"><span class="section-number-4">8.3.2</span> System Model</h4>
<div class="outline-text-4" id="text-8-3-2">
<ul class="org-ul">
<li><b>history of p<sub>i</sub></b>: all events within p<sub>i</sub> and ordered by their occurences
<ul class="org-ul">
<li>h<sub>i</sub> = &lt;e<sub>i</sub><sup>1</sup>,e<sub>i</sub><sup>2</sup>,..&gt;
</li>
</ul>
</li>
<li><b>prefix of history of p<sub>i</sub></b>: first k events in h<sub>i</sub>
<ul class="org-ul">
<li>h<sub>i</sub><sup>k</sup> = &lt;e<sub>i</sub><sup>1</sup>,e<sub>i</sub><sup>2</sup>,..,e<sub>i</sub><sup>k</sup>&gt;
</li>
</ul>
</li>
<li><b>cut</b>: union of prefixes of histories
<ul class="org-ul">
<li>C = h<sub>1</sub><sup>c<sub>1</sub></sup> &cup; h<sub>2</sub><sup>c<sub>2</sub></sup> &cup; .. &cup; h<sub>N</sub><sup>c<sub>N</sub></sup>
</li>
</ul>
</li>
<li><b>global state</b>: set of states of all processes
<ul class="org-ul">
<li>let s<sub>i</sub><sup>k</sup> be state of p<sub>i</sub> after k<sup>th</sup> event occurence
</li>
<li>note that each global state &lt;s<sub>1</sub><sup>c<sub>1</sub></sup>,s<sub>2</sub><sup>c<sub>2</sub></sup>,..,s<sub>N</sub><sup>c<sub>N</sub></sup>&gt; corresponds to a cut
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-3-3" class="outline-4">
<h4 id="sec-8-3-3"><span class="section-number-4">8.3.3</span> Consistent Cut</h4>
<div class="outline-text-4" id="text-8-3-3">
<ul class="org-ul">
<li>interested in cuts that are consistent
</li>
<li><b>cut C is consistent</b>: &forall; event e &isin; C, f &rarr; e &rArr; f &isin; C
</li>
<li>otherwise, not consistent
</li>
<li>the corresponding global state of consistent cut is called a consistent global state
</li>
<li>in reality, system passes through consistent global states only
</li>
<li>gurantees 0 deadlock
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-3-4" class="outline-4">
<h4 id="sec-8-3-4"><span class="section-number-4">8.3.4</span> Recording Snapshot</h4>
<div class="outline-text-4" id="text-8-3-4">
<ul class="org-ul">
<li>steps
<ol class="org-ol">
<li>p<sub>1</sub> records its local state
</li>
<li>p<sub>1</sub> sends m to p<sub>2</sub>
</li>
<li>p<sub>2</sub> records its local state ASAP upon receival
</li>
</ol>
</li>
<li>need to include state of communication channel
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-3-5" class="outline-4">
<h4 id="sec-8-3-5"><span class="section-number-4">8.3.5</span> Chandy &amp; Lamport Algorithm</h4>
<div class="outline-text-4" id="text-8-3-5">
</div><ol class="org-ol"><li><a id="sec-8-3-5-1" name="sec-8-3-5-1"></a>Theorem<br  /><div class="outline-text-5" id="text-8-3-5-1">
<p>
Chandy &amp; Lamport Algorithm always selects a consistent cut
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> Distributed Debugging</h3>
<div class="outline-text-3" id="text-8-4">
</div><div id="outline-container-sec-8-4-1" class="outline-4">
<h4 id="sec-8-4-1"><span class="section-number-4">8.4.1</span> Description</h4>
<div class="outline-text-4" id="text-8-4-1">
<ul class="org-ul">
<li>to establish what occurred during execution of DS
</li>
<li>to check whether they are correct
</li>
<li>but there is no global time!
</li>
<li>can use Chandy and Lamport to repeatedly record snapshots?
</li>
<li><b>approach</b>: enumerate all consistent global states and check exhaustively
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-4-2" class="outline-4">
<h4 id="sec-8-4-2"><span class="section-number-4">8.4.2</span> Lattice of Consistent Global States</h4>
<div class="outline-text-4" id="text-8-4-2">
<ul class="org-ul">
<li>starting from initial state, advance one at a time
</li>
<li>each path from root to leaf represents an ordering of events that is consistent with causal ordering
</li>
<li>among possible paths, we can't tell which one actually executed since no global time
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-4-3" class="outline-4">
<h4 id="sec-8-4-3"><span class="section-number-4">8.4.3</span> Observing Consistent Global States</h4>
<div class="outline-text-4" id="text-8-4-3">
<ul class="org-ul">
<li>use additional monitor outside system to observe
</li>
<li>all processes in system send states to monitor
<ul class="org-ul">
<li>p<sub>i</sub> sends its initial state to the monitor process initially
</li>
<li>@e<sub>i</sub><sup>c<sub>i</sub></sup>, p<sub>i</sub> sends state to the monitor
</li>
</ul>
</li>
<li>monitor assembles consistent global states
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-4-4" class="outline-4">
<h4 id="sec-8-4-4"><span class="section-number-4">8.4.4</span> Global State Consistency Theorem</h4>
<div class="outline-text-4" id="text-8-4-4">
<ul class="org-ul">
<li><b>global state</b>: &lt;s<sub>1</sub><sup>c<sub>1</sub></sup>,s<sub>2</sub><sup>c<sub>2</sub></sup>,..,s<sub>N</sub><sup>c<sub>N</sub></sup>&gt;
</li>
<li>V(e<sub>i</sub><sup>c<sub>i</sub></sup>): vector clock timestamp of e<sub>i</sub><sup>c<sub>i</sub></sup>
</li>
<li>&lt;s<sub>1</sub><sup>c<sub>1</sub></sup>,s<sub>2</sub><sup>c<sub>2</sub></sup>,..,s<sub>N</sub><sup>c<sub>N</sub></sup>&gt; is consistent &hArr; &forall; i,j, V(e<sub>i</sub><sup>c<sub>i</sub></sup>)[i] &ge; V(e<sub>j</sub><sup>c<sub>j</sub></sup>)[i]
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-4-5" class="outline-4">
<h4 id="sec-8-4-5"><span class="section-number-4">8.4.5</span> Debugging</h4>
<div class="outline-text-4" id="text-8-4-5">
<p>
How to check if constraint is broken?
</p>
<ol class="org-ol">
<li>construct lattice
</li>
<li>foreach consistent global state, evaluate whether constraint satisfied
<ul class="org-ul">
<li>if all states satisfy, constraint can't be broken
</li>
<li>if &exist; state not satisfying, possible to be broken
</li>
<li>if every path passes through &ge;1 state not satisfying constraint, must be broken
</li>
</ul>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Coordination and Agreement</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Introduction</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Shared values in DS is a problem.
</p>
<ul class="org-ul">
<li><b>mutual exclusion</b>: to coordinate access to shared resources
</li>
<li><b>election</b>: to agree on a coordinator
</li>
<li><b>consensus</b>: to agree on some value
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> Distributed Mutex</h3>
<div class="outline-text-3" id="text-9-2">
</div><div id="outline-container-sec-9-2-1" class="outline-4">
<h4 id="sec-9-2-1"><span class="section-number-4">9.2.1</span> Overview</h4>
<div class="outline-text-4" id="text-9-2-1">
<p>
Objective:
</p>
<ul class="org-ul">
<li>prevents interference when a set of processes access shared resources
</li>
<li>extends critical section problem in OS
</li>
</ul>

<p>
Distributed mutex:
</p>
<ul class="org-ul">
<li>unlike standalone systems, in DS, neither shared variables nor facilities supplied by single local kernel can solve problem
</li>
<li>solution solely on <b>message passing</b>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9-2-2" class="outline-4">
<h4 id="sec-9-2-2"><span class="section-number-4">9.2.2</span> System Model</h4>
<div class="outline-text-4" id="text-9-2-2">
<ul class="org-ul">
<li>N processes p<sub>1</sub>,..,p<sub>N</sub> that don't share variables
</li>
<li>enter critical section to access shared resources
<ul class="org-ul">
<li>application-level protocol for CS
<ul class="org-ul">
<li>enter()
</li>
<li>resourceAccess()
</li>
<li>exit()
</li>
</ul>
</li>
</ul>
</li>
<li>asynchronous sytem
</li>
</ul>
</div>
</div>
