CZ4013/summary.org
*** Requirements
- *safety*: \leq 1 process execute in CS at a time
- *liveness*: eventually succeeds
  - no deadlock
  - no starvation
*** Performance Metrics
- *bandwidth consumption*: # of messages sent each entry and exit 
- *client delay*: delay of each entry
- *throughput*: rate at which set of processes can access CS
  - synchronization delay: between exiting process and next entering process
  - focus on when process constantly wants to enter CS
*** Central Server Algorithm
**** Description
- server grants permission to enter CS
- to enter CS
  1. request to server and waits
  2. if no other process has token, reply with token
  3. otherwise, queue request
- to exit CS
  1. send token to server
  2. server selects oldest request from queue
**** Analysis
- *safety*: only 1 token
- *liveness*: FIFO ensures no deadlock/starvation
- not scalable due to centralized design
- *bandwidth consumption*
  - entering: 2 messages
  - exiting: 1 message
- *client delay*: 2 transmissions
- *synchronization delay*: 2 transmissions
*** Ring-Based Algorithms
Arrange processes in a logical ring. Circulate token around ring.
When received,
- if not wanted, forward token
- if wanted, retain token & enter CS

To exit CS, simply forward token to neighbour.

Analysis
- *safety*: only one token
- *liveness*: progress (no deadlock) and pass as soon as finish (no starvation)
- entry depends on location in ring, not necessarily on time order of request
- *bandwidth consumption*
  - if every process wants to enter CS, good
  - otherwise unbounded
- *client delay* \in [0,N] transmissions
- *sync delay* \in [1,N] transmissions
*** Ricart and Agrawala Algorithm
**** Description
- require total ordering of events
  - e.g. use Lamport logical clocks and break ties with PID
- process states \in {RELEASED,WANTED,HELD}
- entry
  1. state = WANTED
  2. send requests to all other processes
  3. wait for N-1 replies
  4. enter CS, state = HELD
- upon receival of request,
  1. if state = RELEASED or (state = WANTED and T_j < T_i)
     - reply
  2. otherwise, queue request
- exit
  1. state = RELEASED
  2. reply all queued requests
**** Analysis
- *safety*: since requests are totally ordered, safe
- *liveness*: FIFO queue \rightarrow no deadlock, no starvation
- *bandwidth consumption*: 2(N-1)
- *client delay*: 2 transmissions
- *sync delay*: 1 transmission
** Election
*** Introduction
- objective
  - choose unique process to play role, e.g. coordinator
  - if current crash/retires, need election to choose new one
- process initiates election if it starts particular run of election algo
  - 1 process doesn't initiate >1 election at a time
  - diff processes may call elections concurrently
  - more processes may fail during election
    - need to ensure non-crashed process is elected
- assume each process has PID
- WLOG, we require coordinator be chosen as process w/ largest PID
*** Performance Metrics
- *bandwidth consumption*: total #messages sent
- *T_{round}*: time between termination and initiation
*** Ring-Based Algorithm
**** Description
- assume asynchronous system and no failure
- process state \in {PARTICIPANT, NON_PARTICIPANT}
- initially, each process is NON_PARTICIPANT
- any process can initiate election:
  1. mark self as participant
  2. place PID in election message
  3. send to successor
- when process receives *election message*, compare message PID w/ own PID
  - if message PID > own PID, forward
  - if message PID < own PID and NON_PARTICIPANT, substitute & forward
  - if message PID < own PID and PARTICIPANT, stop
  - if message PID = own PID, be coordinator
- coordinator becomes NON_PARTICIPANT and sends *elected message* to neighbour, announce election, enclose identity
- when p_i receives election message
  - p_i becomes NON_PARTICIPANT
  - records coordinator PID
  - p_i forwards *elected message* to neighbour unless coordinator
**** Analysis
- correctness: involves all, unique even under concurrency
- *bandwidth consumption*
  - suppose only 1 initiating process
  - \leq N-1 election messages to get into largest
  - N more election messages to confirm
  - N elected messages for announcment of new coordinator
  - i.e. total is 3N-1 messages
- *T_{round}*
  - 3N-1 message transmissions since messages are sent sequentially

*** Bully Algorithm
**** Description
- suppose p_i knows processes p_j s.t. PID(p_j) > PID(p_i)
- three types of messages:
  - *ELECTION*: announce election
  - *ANSWER*: respond to election message
  - *COORDINATOR*: announce identity of coordinator
- if detect coordinator crash, begin election (may be concurrent)
- start election
  1. P sends election message to all p_j's and waits
  2. If within T no response, P wins and becomes coordinator
  3. If \exists p_j replying, P waits for coordinator message
- upon receival of election message from smaller PID
  1. send back answer message
  2. begin election if haven't
- if crashed process comes back up
  - if largest decide coordinator and announce
  - otherwise begin election
**** Analysis
- correctness
  - for any p_i, p_j, one with smaller PID discovers that the greater exists and defer to it
  - unique
- *bandwidth consumption*
  - suppose coordinator crash
  - best case: second largest detects crash \rightarrow 1 election message + (N-2) COORDINATOR messages
  - worst case: smallest detects crash \rightarrow O(N) election messages, each starts O(N) elections \rightarrow O(N^2)
- *T_{round}*: T + 1 transmission
** Consensus Problem
