CZ4013/summary.html
<div id="outline-container-sec-9-2-3" class="outline-4">
<h4 id="sec-9-2-3"><span class="section-number-4">9.2.3</span> Requirements</h4>
<div class="outline-text-4" id="text-9-2-3">
<ul class="org-ul">
<li><b>safety</b>: &le; 1 process execute in CS at a time
</li>
<li><b>liveness</b>: eventually succeeds
<ul class="org-ul">
<li>no deadlock
</li>
<li>no starvation
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9-2-4" class="outline-4">
<h4 id="sec-9-2-4"><span class="section-number-4">9.2.4</span> Performance Metrics</h4>
<div class="outline-text-4" id="text-9-2-4">
<ul class="org-ul">
<li><b>bandwidth consumption</b>: # of messages sent each entry and exit 
</li>
<li><b>client delay</b>: delay of each entry
</li>
<li><b>throughput</b>: rate at which set of processes can access CS
<ul class="org-ul">
<li>synchronization delay: between exiting process and next entering process
</li>
<li>focus on when process constantly wants to enter CS
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9-2-5" class="outline-4">
<h4 id="sec-9-2-5"><span class="section-number-4">9.2.5</span> Central Server Algorithm</h4>
<div class="outline-text-4" id="text-9-2-5">
</div><ol class="org-ol"><li><a id="sec-9-2-5-1" name="sec-9-2-5-1"></a>Description<br  /><div class="outline-text-5" id="text-9-2-5-1">
<ul class="org-ul">
<li>server grants permission to enter CS
</li>
<li>to enter CS
<ol class="org-ol">
<li>request to server and waits
</li>
<li>if no other process has token, reply with token
</li>
<li>otherwise, queue request
</li>
</ol>
</li>
<li>to exit CS
<ol class="org-ol">
<li>send token to server
</li>
<li>server selects oldest request from queue
</li>
</ol>
</li>
</ul>
</div>
</li>
<li><a id="sec-9-2-5-2" name="sec-9-2-5-2"></a>Analysis<br  /><div class="outline-text-5" id="text-9-2-5-2">
<ul class="org-ul">
<li><b>safety</b>: only 1 token
</li>
<li><b>liveness</b>: FIFO ensures no deadlock/starvation
</li>
<li>not scalable due to centralized design
</li>
<li><b>bandwidth consumption</b>
<ul class="org-ul">
<li>entering: 2 messages
</li>
<li>exiting: 1 message
</li>
</ul>
</li>
<li><b>client delay</b>: 2 transmissions
</li>
<li><b>synchronization delay</b>: 2 transmissions
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-9-2-6" class="outline-4">
<h4 id="sec-9-2-6"><span class="section-number-4">9.2.6</span> Ring-Based Algorithms</h4>
<div class="outline-text-4" id="text-9-2-6">
<p>
Arrange processes in a logical ring. Circulate token around ring.
When received,
</p>
<ul class="org-ul">
<li>if not wanted, forward token
</li>
<li>if wanted, retain token &amp; enter CS
</li>
</ul>

<p>
To exit CS, simply forward token to neighbour.
</p>

<p>
Analysis
</p>
<ul class="org-ul">
<li><b>safety</b>: only one token
</li>
<li><b>liveness</b>: progress (no deadlock) and pass as soon as finish (no starvation)
</li>
<li>entry depends on location in ring, not necessarily on time order of request
</li>
<li><b>bandwidth consumption</b>
<ul class="org-ul">
<li>if every process wants to enter CS, good
</li>
<li>otherwise unbounded
</li>
</ul>
</li>
<li><b>client delay</b> &isin; [0,N] transmissions
</li>
<li><b>sync delay</b> &isin; [1,N] transmissions
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9-2-7" class="outline-4">
<h4 id="sec-9-2-7"><span class="section-number-4">9.2.7</span> Ricart and Agrawala Algorithm</h4>
<div class="outline-text-4" id="text-9-2-7">
</div><ol class="org-ol"><li><a id="sec-9-2-7-1" name="sec-9-2-7-1"></a>Description<br  /><div class="outline-text-5" id="text-9-2-7-1">
<ul class="org-ul">
<li>require total ordering of events
<ul class="org-ul">
<li>e.g. use Lamport logical clocks and break ties with PID
</li>
</ul>
</li>
<li>process states &isin; {RELEASED,WANTED,HELD}
</li>
<li>entry
<ol class="org-ol">
<li>state = WANTED
</li>
<li>send requests to all other processes
</li>
<li>wait for N-1 replies
</li>
<li>enter CS, state = HELD
</li>
</ol>
</li>
<li>upon receival of request,
<ol class="org-ol">
<li>if state = RELEASED or (state = WANTED and T<sub>j</sub> &lt; T<sub>i</sub>)
<ul class="org-ul">
<li>reply
</li>
</ul>
</li>
<li>otherwise, queue request
</li>
</ol>
</li>
<li>exit
<ol class="org-ol">
<li>state = RELEASED
</li>
<li>reply all queued requests
</li>
</ol>
</li>
</ul>
</div>
</li>
<li><a id="sec-9-2-7-2" name="sec-9-2-7-2"></a>Analysis<br  /><div class="outline-text-5" id="text-9-2-7-2">
<ul class="org-ul">
<li><b>safety</b>: since requests are totally ordered, safe
</li>
<li><b>liveness</b>: FIFO queue &rarr; no deadlock, no starvation
</li>
<li><b>bandwidth consumption</b>: 2(N-1)
</li>
<li><b>client delay</b>: 2 transmissions
</li>
<li><b>sync delay</b>: 1 transmission
</li>
</ul>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> Election</h3>
<div class="outline-text-3" id="text-9-3">
</div><div id="outline-container-sec-9-3-1" class="outline-4">
<h4 id="sec-9-3-1"><span class="section-number-4">9.3.1</span> Introduction</h4>
<div class="outline-text-4" id="text-9-3-1">
<ul class="org-ul">
<li>objective
<ul class="org-ul">
<li>choose unique process to play role, e.g. coordinator
</li>
<li>if current crash/retires, need election to choose new one
</li>
</ul>
</li>
<li>process initiates election if it starts particular run of election algo
<ul class="org-ul">
<li>1 process doesn't initiate &gt;1 election at a time
</li>
<li>diff processes may call elections concurrently
</li>
<li>more processes may fail during election
<ul class="org-ul">
<li>need to ensure non-crashed process is elected
</li>
</ul>
</li>
</ul>
</li>
<li>assume each process has PID
</li>
<li>WLOG, we require coordinator be chosen as process w/ largest PID
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9-3-2" class="outline-4">
<h4 id="sec-9-3-2"><span class="section-number-4">9.3.2</span> Performance Metrics</h4>
<div class="outline-text-4" id="text-9-3-2">
<ul class="org-ul">
<li><b>bandwidth consumption</b>: total #messages sent
</li>
<li><b>T<sub>round</sub></b>: time between termination and initiation
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9-3-3" class="outline-4">
<h4 id="sec-9-3-3"><span class="section-number-4">9.3.3</span> Ring-Based Algorithm</h4>
<div class="outline-text-4" id="text-9-3-3">
</div><ol class="org-ol"><li><a id="sec-9-3-3-1" name="sec-9-3-3-1"></a>Description<br  /><div class="outline-text-5" id="text-9-3-3-1">
<ul class="org-ul">
<li>assume asynchronous system and no failure
</li>
<li>process state &isin; {PARTICIPANT, NON<sub>PARTICIPANT</sub>}
</li>
<li>initially, each process is NON<sub>PARTICIPANT</sub>
</li>
<li>any process can initiate election:
<ol class="org-ol">
<li>mark self as participant
</li>
<li>place PID in election message
</li>
<li>send to successor
</li>
</ol>
</li>
<li>when process receives <b>election message</b>, compare message PID w/ own PID
<ul class="org-ul">
<li>if message PID &gt; own PID, forward
</li>
<li>if message PID &lt; own PID and NON<sub>PARTICIPANT</sub>, substitute &amp; forward
</li>
<li>if message PID &lt; own PID and PARTICIPANT, stop
</li>
<li>if message PID = own PID, be coordinator
</li>
</ul>
</li>
<li>coordinator becomes NON<sub>PARTICIPANT</sub> and sends <b>elected message</b> to neighbour, announce election, enclose identity
</li>
<li>when p<sub>i</sub> receives election message
<ul class="org-ul">
<li>p<sub>i</sub> becomes NON<sub>PARTICIPANT</sub>
</li>
<li>records coordinator PID
</li>
<li>p<sub>i</sub> forwards <b>elected message</b> to neighbour unless coordinator
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-9-3-3-2" name="sec-9-3-3-2"></a>Analysis<br  /><div class="outline-text-5" id="text-9-3-3-2">
<ul class="org-ul">
<li>correctness: involves all, unique even under concurrency
</li>
<li><b>bandwidth consumption</b>
<ul class="org-ul">
<li>suppose only 1 initiating process
</li>
<li>&le; N-1 election messages to get into largest
</li>
<li>N more election messages to confirm
</li>
<li>N elected messages for announcment of new coordinator
</li>
<li>i.e. total is 3N-1 messages
</li>
</ul>
</li>
<li><b>T<sub>round</sub></b>
<ul class="org-ul">
<li>3N-1 message transmissions since messages are sent sequentially
</li>
</ul>
</li>
</ul>
</div>
</li></ol>
</div>

<div id="outline-container-sec-9-3-4" class="outline-4">
<h4 id="sec-9-3-4"><span class="section-number-4">9.3.4</span> Bully Algorithm</h4>
<div class="outline-text-4" id="text-9-3-4">
</div><ol class="org-ol"><li><a id="sec-9-3-4-1" name="sec-9-3-4-1"></a>Description<br  /><div class="outline-text-5" id="text-9-3-4-1">
<ul class="org-ul">
<li>suppose p<sub>i</sub> knows processes p<sub>j</sub> s.t. PID(p<sub>j</sub>) &gt; PID(p<sub>i</sub>)
</li>
<li>three types of messages:
<ul class="org-ul">
<li><b>ELECTION</b>: announce election
</li>
<li><b>ANSWER</b>: respond to election message
</li>
<li><b>COORDINATOR</b>: announce identity of coordinator
</li>
</ul>
</li>
<li>if detect coordinator crash, begin election (may be concurrent)
</li>
<li>start election
<ol class="org-ol">
<li>P sends election message to all p<sub>j's</sub> and waits
</li>
<li>If within T no response, P wins and becomes coordinator
</li>
<li>If &exist; p<sub>j</sub> replying, P waits for coordinator message
</li>
</ol>
</li>
<li>upon receival of election message from smaller PID
<ol class="org-ol">
<li>send back answer message
</li>
<li>begin election if haven't
</li>
</ol>
</li>
<li>if crashed process comes back up
<ul class="org-ul">
<li>if largest decide coordinator and announce
</li>
<li>otherwise begin election
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-9-3-4-2" name="sec-9-3-4-2"></a>Analysis<br  /><div class="outline-text-5" id="text-9-3-4-2">
<ul class="org-ul">
<li>correctness
<ul class="org-ul">
<li>for any p<sub>i</sub>, p<sub>j</sub>, one with smaller PID discovers that the greater exists and defer to it
</li>
<li>unique
</li>
</ul>
</li>
<li><b>bandwidth consumption</b>
<ul class="org-ul">
<li>suppose coordinator crash
</li>
<li>best case: second largest detects crash &rarr; 1 election message + (N-2) COORDINATOR messages
</li>
<li>worst case: smallest detects crash &rarr; O(N) election messages, each starts O(N) elections &rarr; O(N<sup>2</sup>)
</li>
</ul>
</li>
<li><b>T<sub>round</sub></b>: T + 1 transmission
</li>
</ul>
</div>
</li></ol>
</div>
</div>
