CZ4013/summary.org
*** Introduction
Objective:
To agree on a value even in presence of failures after \geq 1 processes proposed value
- to transfer funds, processes must consistently agree to perform respective debit and credit
- in mutex, processes agree on who can enter CS
- in election, processes agree on who's the coordinator
- so consensus problem is a generalization
*** System Model
- N processes p_1,..,p_N communicating by message passing
- synchronous / asynchronous
- \leq f of N processes may fail
- every process p_i begins in UNDECIDED state, proposes v_i
- communicate to exchange values
- process p_i sets value of a decision variable d_i and enters DECIDED state

*** Requirements
**** Termination
Each correct process must set its decision variable d_i
**** Agreement
Decision values of of correct processes are same. d_1=..=d_N
**** Integrity
If correct processes all proposed same value, then all correct processes in DECIDED state has chosen that value
*** Synchronous
**** Assumptions
\leq f of N processes may crash
**** In absence of process crash
- each process p_i multicasts v_i to p_j \forall j
- each p_i waits until collected all N values and then evaluates a function to set decision variable
  - i.e. d_i = f(v_1,..,v_N)
**** When process crash
- faulty process may crash in the middle of multicast
  - may not send values to all p_j
- need to guarantee processes still receive same set of values
**** Solution
- proceeds f+1 rounds
  - each round, correct processes multicast values to p_j
  - in the end of (f+1)^{th} round, all correct processes that survive must have received same set of values
  - then each process evaluates a function to set decision variable
**** Theorem
Any algorithm to reach consensus despite \leq f crash failures requires \geq f+1 rounds of message exchanges

This lower bound also applies to case of byzantine failures.
*** Asynchronous = Impossible
In synchronous, message exchanges take place in rounds. If no message received within the round, assume process to be crashed.

In asynchronous, a crashed process is indistinguishable from a slow one.
* Replication and Consistency
** Introduction
- maintains copies of data at multiple copies
- improve performance and scalability
- increase reliability and fault-tolerance
- have to keep replicas consistent
** System Model
Each logical data object is implemented by a collection of replicas
*** Static vs Dynamic
- static: contains fixed set of replicas
- dynamic: replicas may be created/destroyed on the fly (not considered)
*** Transparency
- clients unaware of replicas
- clients see logical objects only
*** Data operations
- read
- write
- atomic operations @ replicas
*** Possible failures
- crash (process omission)
- byzantine (process)
- Network partition
*** Consistency model
- read returns value that shows result of last write
- but due to network elay, replicas are not necessarily consistent all time
- consistency models
  - define what is "correct" behavior
  - concern whether operations performed on collection of replicas produce results that meet correctness criteria
** Data-Centric Consistency Models
*** Overview
- target scenario: concurrent processes may simultaneously update data objects
- objective: to provide system-wide consistent view of data objects in face of concurrency
*** Strict concurrency
Absolute time ordering of all operations
*** Sequential concurrency
- all clients see all operations in same order
- operations may not be ordered in absolute time
*** Causal and FIFO
Different clients may see opeartions in different orders
**** Causal concurrency
All clients see causally-related operations in same order, but non-causally related operations may be viewed in different orders.
**** FIFO concurrency
All clients see writes from each other in the order they were issued, but other than that, can be seen in different orders.
** Data-Centric Consistency Protocols
*** Description
A consistency protocol describes an *implementation* of a specific consistency model.

We will look at fault-tolerant aspecs:
- does it handle faults?
- what type of faults?
- how many faults can it tolerate?
*** Primary-Based Protocols
**** Overview
- one primary replica, several backups
- passive replication
- primary replica coordinates writes
- if primary crashes, elect primary from backups
- examples:
  - remote-write: fixed primary replica
  - local-write: primary replica can be moved
**** Remote-write Protocol
