CZ4013/summary.html
<div id="outline-container-sec-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> Consensus Problem</h3>
<div class="outline-text-3" id="text-9-4">
</div><div id="outline-container-sec-9-4-1" class="outline-4">
<h4 id="sec-9-4-1"><span class="section-number-4">9.4.1</span> Introduction</h4>
<div class="outline-text-4" id="text-9-4-1">
<p>
Objective:
To agree on a value even in presence of failures after &ge; 1 processes proposed value
</p>
<ul class="org-ul">
<li>to transfer funds, processes must consistently agree to perform respective debit and credit
</li>
<li>in mutex, processes agree on who can enter CS
</li>
<li>in election, processes agree on who's the coordinator
</li>
<li>so consensus problem is a generalization
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9-4-2" class="outline-4">
<h4 id="sec-9-4-2"><span class="section-number-4">9.4.2</span> System Model</h4>
<div class="outline-text-4" id="text-9-4-2">
<ul class="org-ul">
<li>N processes p<sub>1</sub>,..,p<sub>N</sub> communicating by message passing
</li>
<li>synchronous / asynchronous
</li>
<li>&le; f of N processes may fail
</li>
<li>every process p<sub>i</sub> begins in UNDECIDED state, proposes v<sub>i</sub>
</li>
<li>communicate to exchange values
</li>
<li>process p<sub>i</sub> sets value of a decision variable d<sub>i</sub> and enters DECIDED state
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9-4-3" class="outline-4">
<h4 id="sec-9-4-3"><span class="section-number-4">9.4.3</span> Requirements</h4>
<div class="outline-text-4" id="text-9-4-3">
</div><ol class="org-ol"><li><a id="sec-9-4-3-1" name="sec-9-4-3-1"></a>Termination<br  /><div class="outline-text-5" id="text-9-4-3-1">
<p>
Each correct process must set its decision variable d<sub>i</sub>
</p>
</div>
</li>
<li><a id="sec-9-4-3-2" name="sec-9-4-3-2"></a>Agreement<br  /><div class="outline-text-5" id="text-9-4-3-2">
<p>
Decision values of of correct processes are same. d<sub>1</sub>=..=d<sub>N</sub>
</p>
</div>
</li>
<li><a id="sec-9-4-3-3" name="sec-9-4-3-3"></a>Integrity<br  /><div class="outline-text-5" id="text-9-4-3-3">
<p>
If correct processes all proposed same value, then all correct processes in DECIDED state has chosen that value
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-9-4-4" class="outline-4">
<h4 id="sec-9-4-4"><span class="section-number-4">9.4.4</span> Synchronous</h4>
<div class="outline-text-4" id="text-9-4-4">
</div><ol class="org-ol"><li><a id="sec-9-4-4-1" name="sec-9-4-4-1"></a>Assumptions<br  /><div class="outline-text-5" id="text-9-4-4-1">
<p>
&le; f of N processes may crash
</p>
</div>
</li>
<li><a id="sec-9-4-4-2" name="sec-9-4-4-2"></a>In absence of process crash<br  /><div class="outline-text-5" id="text-9-4-4-2">
<ul class="org-ul">
<li>each process p<sub>i</sub> multicasts v<sub>i</sub> to p<sub>j</sub> &forall; j
</li>
<li>each p<sub>i</sub> waits until collected all N values and then evaluates a function to set decision variable
<ul class="org-ul">
<li>i.e. d<sub>i</sub> = f(v<sub>1</sub>,..,v<sub>N</sub>)
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-9-4-4-3" name="sec-9-4-4-3"></a>When process crash<br  /><div class="outline-text-5" id="text-9-4-4-3">
<ul class="org-ul">
<li>faulty process may crash in the middle of multicast
<ul class="org-ul">
<li>may not send values to all p<sub>j</sub>
</li>
</ul>
</li>
<li>need to guarantee processes still receive same set of values
</li>
</ul>
</div>
</li>
<li><a id="sec-9-4-4-4" name="sec-9-4-4-4"></a>Solution<br  /><div class="outline-text-5" id="text-9-4-4-4">
<ul class="org-ul">
<li>proceeds f+1 rounds
<ul class="org-ul">
<li>each round, correct processes multicast values to p<sub>j</sub>
</li>
<li>in the end of (f+1)<sup>th</sup> round, all correct processes that survive must have received same set of values
</li>
<li>then each process evaluates a function to set decision variable
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-9-4-4-5" name="sec-9-4-4-5"></a>Theorem<br  /><div class="outline-text-5" id="text-9-4-4-5">
<p>
Any algorithm to reach consensus despite &le; f crash failures requires &ge; f+1 rounds of message exchanges
</p>

<p>
This lower bound also applies to case of byzantine failures.
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-9-4-5" class="outline-4">
<h4 id="sec-9-4-5"><span class="section-number-4">9.4.5</span> Asynchronous = Impossible</h4>
<div class="outline-text-4" id="text-9-4-5">
<p>
In synchronous, message exchanges take place in rounds. If no message received within the round, assume process to be crashed.
</p>

<p>
In asynchronous, a crashed process is indistinguishable from a slow one.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Replication and Consistency</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> Introduction</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li>maintains copies of data at multiple copies
</li>
<li>improve performance and scalability
</li>
<li>increase reliability and fault-tolerance
</li>
<li>have to keep replicas consistent
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> System Model</h3>
<div class="outline-text-3" id="text-10-2">
<p>
Each logical data object is implemented by a collection of replicas
</p>
</div>
<div id="outline-container-sec-10-2-1" class="outline-4">
<h4 id="sec-10-2-1"><span class="section-number-4">10.2.1</span> Static vs Dynamic</h4>
<div class="outline-text-4" id="text-10-2-1">
<ul class="org-ul">
<li>static: contains fixed set of replicas
</li>
<li>dynamic: replicas may be created/destroyed on the fly (not considered)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-10-2-2" class="outline-4">
<h4 id="sec-10-2-2"><span class="section-number-4">10.2.2</span> Transparency</h4>
<div class="outline-text-4" id="text-10-2-2">
<ul class="org-ul">
<li>clients unaware of replicas
</li>
<li>clients see logical objects only
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-10-2-3" class="outline-4">
<h4 id="sec-10-2-3"><span class="section-number-4">10.2.3</span> Data operations</h4>
<div class="outline-text-4" id="text-10-2-3">
<ul class="org-ul">
<li>read
</li>
<li>write
</li>
<li>atomic operations @ replicas
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-10-2-4" class="outline-4">
<h4 id="sec-10-2-4"><span class="section-number-4">10.2.4</span> Possible failures</h4>
<div class="outline-text-4" id="text-10-2-4">
<ul class="org-ul">
<li>crash (process omission)
</li>
<li>byzantine (process)
</li>
<li>Network partition
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-10-2-5" class="outline-4">
<h4 id="sec-10-2-5"><span class="section-number-4">10.2.5</span> Consistency model</h4>
<div class="outline-text-4" id="text-10-2-5">
<ul class="org-ul">
<li>read returns value that shows result of last write
</li>
<li>but due to network elay, replicas are not necessarily consistent all time
</li>
<li>consistency models
<ul class="org-ul">
<li>define what is "correct" behavior
</li>
<li>concern whether operations performed on collection of replicas produce results that meet correctness criteria
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> Data-Centric Consistency Models</h3>
<div class="outline-text-3" id="text-10-3">
</div><div id="outline-container-sec-10-3-1" class="outline-4">
<h4 id="sec-10-3-1"><span class="section-number-4">10.3.1</span> Overview</h4>
<div class="outline-text-4" id="text-10-3-1">
<ul class="org-ul">
<li>target scenario: concurrent processes may simultaneously update data objects
</li>
<li>objective: to provide system-wide consistent view of data objects in face of concurrency
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-10-3-2" class="outline-4">
<h4 id="sec-10-3-2"><span class="section-number-4">10.3.2</span> Strict concurrency</h4>
<div class="outline-text-4" id="text-10-3-2">
<p>
Absolute time ordering of all operations
</p>
</div>
</div>
<div id="outline-container-sec-10-3-3" class="outline-4">
<h4 id="sec-10-3-3"><span class="section-number-4">10.3.3</span> Sequential concurrency</h4>
<div class="outline-text-4" id="text-10-3-3">
<ul class="org-ul">
<li>all clients see all operations in same order
</li>
<li>operations may not be ordered in absolute time
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-10-3-4" class="outline-4">
<h4 id="sec-10-3-4"><span class="section-number-4">10.3.4</span> Causal and FIFO</h4>
<div class="outline-text-4" id="text-10-3-4">
<p>
Different clients may see opeartions in different orders
</p>
</div>
<ol class="org-ol"><li><a id="sec-10-3-4-1" name="sec-10-3-4-1"></a>Causal concurrency<br  /><div class="outline-text-5" id="text-10-3-4-1">
<p>
All clients see causally-related operations in same order, but non-causally related operations may be viewed in different orders.
</p>
</div>
</li>
<li><a id="sec-10-3-4-2" name="sec-10-3-4-2"></a>FIFO concurrency<br  /><div class="outline-text-5" id="text-10-3-4-2">
<p>
All clients see writes from each other in the order they were issued, but other than that, can be seen in different orders.
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-10-4" class="outline-3">
<h3 id="sec-10-4"><span class="section-number-3">10.4</span> Data-Centric Consistency Protocols</h3>
<div class="outline-text-3" id="text-10-4">
</div><div id="outline-container-sec-10-4-1" class="outline-4">
<h4 id="sec-10-4-1"><span class="section-number-4">10.4.1</span> Description</h4>
<div class="outline-text-4" id="text-10-4-1">
<p>
A consistency protocol describes an <b>implementation</b> of a specific consistency model.
</p>

<p>
We will look at fault-tolerant aspecs:
</p>
<ul class="org-ul">
<li>does it handle faults?
</li>
<li>what type of faults?
</li>
<li>how many faults can it tolerate?
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-10-4-2" class="outline-4">
<h4 id="sec-10-4-2"><span class="section-number-4">10.4.2</span> Primary-Based Protocols</h4>
<div class="outline-text-4" id="text-10-4-2">
</div><ol class="org-ol"><li><a id="sec-10-4-2-1" name="sec-10-4-2-1"></a>Overview<br  /><div class="outline-text-5" id="text-10-4-2-1">
<ul class="org-ul">
<li>one primary replica, several backups
</li>
<li>passive replication
</li>
<li>primary replica coordinates writes
</li>
<li>if primary crashes, elect primary from backups
</li>
<li>examples:
<ul class="org-ul">
<li>remote-write: fixed primary replica
</li>
<li>local-write: primary replica can be moved
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-10-4-2-2" name="sec-10-4-2-2"></a>Remote-write Protocol<br  /><ol class="org-ol"><li><a id="sec-10-4-2-2-1" name="sec-10-4-2-2-1"></a>Mechanism<br  /><div class="outline-text-6" id="text-10-4-2-2-1">
<ul class="org-ul">
