CZ4013/summary.org
***** Mechanism
- writes forwarded to primary
  1. primary performs update and forwards update to replicas
  2. each backup performs update
  3. primary send ack back to client
  - writes are blocking
- reads at any replica
***** A sequential consistency implementation
- primary replica orders writes in globally unique order
- all clients see all writes in same order, no matter which replica they use to perform reads
- due to blocking, clients always see effects of most recent writes
**** Local-write Protocol
- primary migrates between replicas that want to write
- writes can be non-blocking
  1. return ack to client after primary updates
  2. primary tells backups to update
- advantages:
  - multiple successive writes locally
  - enable disconnected mode
**** Fault tolerance
- can handle crashes
- to tolerate \leq f process crashes, must have f+1 replicas
- cannot deal with byzantine failures
  - only one replica executes operations
*** Replicated-Write Protocols
Writes at multiple replicas
**** Active replication
***** Description
- all replicas play *same role*
- writes at all replicas
  - operations sent to all via *totally ordered multicast*
  - all replicas start in same state and perform same operations in same order
  - writes are blocking
  - no action needed if a replica crash
- reads at any replicas
***** Analysis
- achieves sequential consistency
  - totally ordered multicast orders all writes
- fault tolerance
  - process omission:
    - client waits only for first response
  - byzantine:
    - to tolerate \leq f failures, 2f+1 replicas needed
    - client waits for f+1 identical responses
**** Gifford's quorum-based protocol
***** Introduction
****** Network Partitions
A network partition separates group of replicas into \geq 2 subgroups s.t.
- replicas of same subgroup can communicate with one anothr
- replicas of different subgroups can't communicate with one another

Partitions will eventually be repaired
- must ensure any operation executed during partition won't make replicas inconsistent when partition is repaired
****** Handling Network Partitions
- Optimistic approach
  - allow updates in all partitions
    - \rightarrow can lead to inconsistencies between partitions
  - resolve inconsistencies when partition is repaired
  - unsuitable for banking
- Pessimistic approach
  - allow updates in one partition only
    - \rightarrow prevents inconsistencies
  - update remaining replicas when partition is repaired
  - Gifford's quorum-based protocol
***** Design
- *quorum*: subgroup of replicas whose size gives it right to perform operations
- writes may be performed by one quorum only
  - use version numbers
  - writes only on latest replicas
- reads only on a read quorum (\geq R replicas)
- writes only on write quorum (\geq W replicas)
- W > 1/2 N
- R+W > N
***** Operations
****** Read
To perform read, client must assemble a read quorum
- contact a set of \geq R replicas
- set must contain at least one up-to-date replica
- read on any up-to-date replica
****** Write
Must assemble write quorum
- contact a set of \geq W replicas
- set must contain at least one up-to-date replica
- sync out-of-date replicas
- write is then applied to each replica in write quorum
** Client-Centric Consistency Models
*** Overview
- target scenario
  - lack of simultaneous updates (or easy-to-be-resolved updates)
  - most operations involve reading data
- eventual consistency
  - if no update takes place for a long time, all replicas will gradually become consistent
  - only requires that updates are guaranteed to propagaten (possibly lazy)
  - eventual consistency works fine as long as clients always access same replica
  - but problem if different replicas accessed
- guarantees *for a single client* concerning conistency
- no guarantees for concurrent accesses
*** Monotonic reads
- if client reads value of x @ r_i, any r_j for which j>i on x by that client will always return same value or a more recent value
- i.e. if seen x at t, will never see older version of x later
- e.g. distributed email database
*** Monotonic writes
write operation w_i by *a client* on x is completed before w_j j>i
*** Read your writes
Effect of a write operation by a client on x will always be seen by subsequent read operation on x by same client
*** Writes follow reads
- write by client on x following read by same client on x is guaranteed to take place on same/more recent value of x that was read
- writes on x are performed on copy of x that is up-to-date with value most recently read by that client
