CZ4013/summary.html
<li>writes forwarded to primary
<ol class="org-ol">
<li>primary performs update and forwards update to replicas
</li>
<li>each backup performs update
</li>
<li>primary send ack back to client
</li>
<li>writes are blocking
</li>
</ol>
</li>
<li>reads at any replica
</li>
</ul>
</div>
</li>
<li><a id="sec-10-4-2-2-2" name="sec-10-4-2-2-2"></a>A sequential consistency implementation<br  /><div class="outline-text-6" id="text-10-4-2-2-2">
<ul class="org-ul">
<li>primary replica orders writes in globally unique order
</li>
<li>all clients see all writes in same order, no matter which replica they use to perform reads
</li>
<li>due to blocking, clients always see effects of most recent writes
</li>
</ul>
</div>
</li></ol>
</li>
<li><a id="sec-10-4-2-3" name="sec-10-4-2-3"></a>Local-write Protocol<br  /><div class="outline-text-5" id="text-10-4-2-3">
<ul class="org-ul">
<li>primary migrates between replicas that want to write
</li>
<li>writes can be non-blocking
<ol class="org-ol">
<li>return ack to client after primary updates
</li>
<li>primary tells backups to update
</li>
</ol>
</li>
<li>advantages:
<ul class="org-ul">
<li>multiple successive writes locally
</li>
<li>enable disconnected mode
</li>
</ul>
</li>
</ul>
</div>
</li>
<li><a id="sec-10-4-2-4" name="sec-10-4-2-4"></a>Fault tolerance<br  /><div class="outline-text-5" id="text-10-4-2-4">
<ul class="org-ul">
<li>can handle crashes
</li>
<li>to tolerate &le; f process crashes, must have f+1 replicas
</li>
<li>cannot deal with byzantine failures
<ul class="org-ul">
<li>only one replica executes operations
</li>
</ul>
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-10-4-3" class="outline-4">
<h4 id="sec-10-4-3"><span class="section-number-4">10.4.3</span> Replicated-Write Protocols</h4>
<div class="outline-text-4" id="text-10-4-3">
<p>
Writes at multiple replicas
</p>
</div>
<ol class="org-ol"><li><a id="sec-10-4-3-1" name="sec-10-4-3-1"></a>Active replication<br  /><ol class="org-ol"><li><a id="sec-10-4-3-1-1" name="sec-10-4-3-1-1"></a>Description<br  /><div class="outline-text-6" id="text-10-4-3-1-1">
<ul class="org-ul">
<li>all replicas play <b>same role</b>
</li>
<li>writes at all replicas
<ul class="org-ul">
<li>operations sent to all via <b>totally ordered multicast</b>
</li>
<li>all replicas start in same state and perform same operations in same order
</li>
<li>writes are blocking
</li>
<li>no action needed if a replica crash
</li>
</ul>
</li>
<li>reads at any replicas
</li>
</ul>
</div>
</li>
<li><a id="sec-10-4-3-1-2" name="sec-10-4-3-1-2"></a>Analysis<br  /><div class="outline-text-6" id="text-10-4-3-1-2">
<ul class="org-ul">
<li>achieves sequential consistency
<ul class="org-ul">
<li>totally ordered multicast orders all writes
</li>
</ul>
</li>
<li>fault tolerance
<ul class="org-ul">
<li>process omission:
<ul class="org-ul">
<li>client waits only for first response
</li>
</ul>
</li>
<li>byzantine:
<ul class="org-ul">
<li>to tolerate &le; f failures, 2f+1 replicas needed
</li>
<li>client waits for f+1 identical responses
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</li></ol>
</li>
<li><a id="sec-10-4-3-2" name="sec-10-4-3-2"></a>Gifford's quorum-based protocol<br  /><ol class="org-ol"><li><a id="sec-10-4-3-2-1" name="sec-10-4-3-2-1"></a>Introduction<br  /><ol class="org-ol"><li><a id="sec-10-4-3-2-1-1" name="sec-10-4-3-2-1-1"></a>Network Partitions<br  /><div class="outline-text-7" id="text-10-4-3-2-1-1">
<p>
A network partition separates group of replicas into &ge; 2 subgroups s.t.
</p>
<ul class="org-ul">
<li>replicas of same subgroup can communicate with one anothr
</li>
<li>replicas of different subgroups can't communicate with one another
</li>
</ul>

<p>
Partitions will eventually be repaired
</p>
<ul class="org-ul">
<li>must ensure any operation executed during partition won't make replicas inconsistent when partition is repaired
</li>
</ul>
</div>
</li>
<li><a id="sec-10-4-3-2-1-2" name="sec-10-4-3-2-1-2"></a>Handling Network Partitions<br  /><div class="outline-text-7" id="text-10-4-3-2-1-2">
<ul class="org-ul">
<li>Optimistic approach
<ul class="org-ul">
<li>allow updates in all partitions
<ul class="org-ul">
<li>&rarr; can lead to inconsistencies between partitions
</li>
</ul>
</li>
<li>resolve inconsistencies when partition is repaired
</li>
<li>unsuitable for banking
</li>
</ul>
</li>
<li>Pessimistic approach
<ul class="org-ul">
<li>allow updates in one partition only
<ul class="org-ul">
<li>&rarr; prevents inconsistencies
</li>
</ul>
</li>
<li>update remaining replicas when partition is repaired
</li>
<li>Gifford's quorum-based protocol
</li>
</ul>
</li>
</ul>
</div>
</li></ol>
</li>
<li><a id="sec-10-4-3-2-2" name="sec-10-4-3-2-2"></a>Design<br  /><div class="outline-text-6" id="text-10-4-3-2-2">
<ul class="org-ul">
<li><b>quorum</b>: subgroup of replicas whose size gives it right to perform operations
</li>
<li>writes may be performed by one quorum only
<ul class="org-ul">
<li>use version numbers
</li>
<li>writes only on latest replicas
</li>
</ul>
</li>
<li>reads only on a read quorum (&ge; R replicas)
</li>
<li>writes only on write quorum (&ge; W replicas)
</li>
<li>W &gt; 1/2 N
</li>
<li>R+W &gt; N
</li>
</ul>
</div>
</li>
<li><a id="sec-10-4-3-2-3" name="sec-10-4-3-2-3"></a>Operations<br  /><ol class="org-ol"><li><a id="sec-10-4-3-2-3-1" name="sec-10-4-3-2-3-1"></a>Read<br  /><div class="outline-text-7" id="text-10-4-3-2-3-1">
<p>
To perform read, client must assemble a read quorum
</p>
<ul class="org-ul">
<li>contact a set of &ge; R replicas
</li>
<li>set must contain at least one up-to-date replica
</li>
<li>read on any up-to-date replica
</li>
</ul>
</div>
</li>
<li><a id="sec-10-4-3-2-3-2" name="sec-10-4-3-2-3-2"></a>Write<br  /><div class="outline-text-7" id="text-10-4-3-2-3-2">
<p>
Must assemble write quorum
</p>
<ul class="org-ul">
<li>contact a set of &ge; W replicas
</li>
<li>set must contain at least one up-to-date replica
</li>
<li>sync out-of-date replicas
</li>
<li>write is then applied to each replica in write quorum
</li>
</ul>
</div>
</li></ol>
</li></ol>
</li></ol>
</div>
</div>
<div id="outline-container-sec-10-5" class="outline-3">
<h3 id="sec-10-5"><span class="section-number-3">10.5</span> Client-Centric Consistency Models</h3>
<div class="outline-text-3" id="text-10-5">
</div><div id="outline-container-sec-10-5-1" class="outline-4">
<h4 id="sec-10-5-1"><span class="section-number-4">10.5.1</span> Overview</h4>
<div class="outline-text-4" id="text-10-5-1">
<ul class="org-ul">
<li>target scenario
<ul class="org-ul">
<li>lack of simultaneous updates (or easy-to-be-resolved updates)
</li>
<li>most operations involve reading data
</li>
</ul>
</li>
<li>eventual consistency
<ul class="org-ul">
<li>if no update takes place for a long time, all replicas will gradually become consistent
</li>
<li>only requires that updates are guaranteed to propagaten (possibly lazy)
</li>
<li>eventual consistency works fine as long as clients always access same replica
</li>
<li>but problem if different replicas accessed
</li>
</ul>
</li>
<li>guarantees <b>for a single client</b> concerning conistency
</li>
<li>no guarantees for concurrent accesses
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-10-5-2" class="outline-4">
<h4 id="sec-10-5-2"><span class="section-number-4">10.5.2</span> Monotonic reads</h4>
<div class="outline-text-4" id="text-10-5-2">
<ul class="org-ul">
<li>if client reads value of x @ r<sub>i</sub>, any r<sub>j</sub> for which j&gt;i on x by that client will always return same value or a more recent value
</li>
<li>i.e. if seen x at t, will never see older version of x later
</li>
<li>e.g. distributed email database
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-10-5-3" class="outline-4">
<h4 id="sec-10-5-3"><span class="section-number-4">10.5.3</span> Monotonic writes</h4>
<div class="outline-text-4" id="text-10-5-3">
<p>
write operation w<sub>i</sub> by <b>a client</b> on x is completed before w<sub>j</sub> j&gt;i
</p>
</div>
</div>
<div id="outline-container-sec-10-5-4" class="outline-4">
<h4 id="sec-10-5-4"><span class="section-number-4">10.5.4</span> Read your writes</h4>
<div class="outline-text-4" id="text-10-5-4">
<p>
Effect of a write operation by a client on x will always be seen by subsequent read operation on x by same client
</p>
</div>
</div>
<div id="outline-container-sec-10-5-5" class="outline-4">
<h4 id="sec-10-5-5"><span class="section-number-4">10.5.5</span> Writes follow reads</h4>
<div class="outline-text-4" id="text-10-5-5">
<ul class="org-ul">
<li>write by client on x following read by same client on x is guaranteed to take place on same/more recent value of x that was read
</li>
<li>writes on x are performed on copy of x that is up-to-date with value most recently read by that client
</li>
</ul>
</div>
</div>
</div>
