CZ4013/summary.org
** Client-Centric Consistency Protocols
- each write is assigned a globally unique ID
  - can be assigned by origin replica of the write operation
- each client keeps track of 2 sets of write operations
  - read set: IDs of writes relevant to read operations by client
  - write set: IDs of writes performed by client

To implement monotonic-read consistency
- when client performs read operation at a replica, that replica is handed the client's *read set* to check whether all identified writes have taken place locally
- if not, replica contacts other replicas to ensure it is brought up to date
- alternatively, read operation is forwarded to a replica where the identified writes have already taken place
- after read, write operations that have taken place at selected replica and which are relevant for read operation are added to client's read set

Finally,
- write ID could include ID of replica performing the write
- replica could be required to log the write operation so that it can be replayed at another replica
- other client-centric consistency models can be implemented in similar ways
