CZ4013/summary.html
<div id="outline-container-sec-10-6" class="outline-3">
<h3 id="sec-10-6"><span class="section-number-3">10.6</span> Client-Centric Consistency Protocols</h3>
<div class="outline-text-3" id="text-10-6">
<ul class="org-ul">
<li>each write is assigned a globally unique ID
<ul class="org-ul">
<li>can be assigned by origin replica of the write operation
</li>
</ul>
</li>
<li>each client keeps track of 2 sets of write operations
<ul class="org-ul">
<li>read set: IDs of writes relevant to read operations by client
</li>
<li>write set: IDs of writes performed by client
</li>
</ul>
</li>
</ul>

<p>
To implement monotonic-read consistency
</p>
<ul class="org-ul">
<li>when client performs read operation at a replica, that replica is handed the client's <b>read set</b> to check whether all identified writes have taken place locally
</li>
<li>if not, replica contacts other replicas to ensure it is brought up to date
</li>
<li>alternatively, read operation is forwarded to a replica where the identified writes have already taken place
</li>
<li>after read, write operations that have taken place at selected replica and which are relevant for read operation are added to client's read set
</li>
</ul>

<p>
Finally,
</p>
<ul class="org-ul">
<li>write ID could include ID of replica performing the write
</li>
<li>replica could be required to log the write operation so that it can be replayed at another replica
</li>
<li>other client-centric consistency models can be implemented in similar ways
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Eric Leonardo Lim</p>
<p class="date">Created: 2018-04-27 Fri 16:02</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
